[
  {
    "Id": "92d4b311-f426-40af-9465-631c99cf3514",
    "Name": "Assassin’s Blood",
    "Type": "Ingested Poison",
    "Cost": "150 GP",
    "Effect": "A creature subjected to Assassin’s Blood makes a DC 10 Constitution saving throw. On a failed save, the creature takes 6 (1d12) Poison damage and has the Poisoned condition for 24 hours. On a successful save, the creature takes half as much damage only."
  },
  {
    "Id": "e104f019-a3c7-443c-8c0b-49dcbd53d404",
    "Name": "Burnt Othur Fumes",
    "Type": "Inhaled Poison",
    "Cost": "500 GP",
    "Effect": "A creature subjected to Burnt Othur Fumes must succeed on a DC 13 Constitution saving throw or take 10 (3d6) Poison damage, and it must repeat the save at the start of each of its turns. On each successive failed save, the creature takes 3 (1d6) Poison damage. After three successful saves, the poison ends."
  },
  {
    "Id": "38c56023-9c39-477f-b55e-b46ca5de87a1",
    "Name": "Carrion Crawler Mucus",
    "Type": "Contact Poison",
    "Cost": "200 GP",
    "Effect": "A creature subjected to Carrion Crawler Mucus must succeed on a DC 13 Constitution saving throw or have the Poisoned condition for 1 minute. The creature also has the Paralyzed condition while Poisoned in this way. The creature repeats the save at the end of each of its turns, ending the effect on itself on a success."
  },
  {
    "Id": "342199ed-ace5-4581-87f4-198615ddf083",
    "Name": "Essence of Ether",
    "Type": "Inhaled Poison",
    "Cost": "300 GP",
    "Effect": "A creature subjected to Essence of Ether must succeed on a DC 15 Constitution saving throw or have the Poisoned condition for 8 hours. The creature also has the Unconscious condition while Poisoned in this way. The creature wakes up if it takes damage or if another creature takes an action to shake it awake."
  },
  {
    "Id": "70108d04-b48f-4cf2-accd-5e247d6f3712",
    "Name": "Lolth’s Sting",
    "Type": "Injury Poison",
    "Cost": "200 GP",
    "Effect": "A creature subjected to Lolth’s Sting must succeed on a DC 13 Constitution saving throw or have the Poisoned condition for 1 hour. If the creature fails the save by 5 or more, the creature also has the Unconscious condition while Poisoned in this way. The creature wakes up if it takes damage or if another creature takes an action to shake it awake."
  },
  {
    "Id": "9123fc03-02af-458b-9148-a05b379912d8",
    "Name": "Malice",
    "Type": "Inhaled Poison",
    "Cost": "250 GP",
    "Effect": "A creature subjected to Malice must succeed on a DC 15 Constitution saving throw or have the Poisoned condition for 1 hour. The creature also has the Blinded condition while Poisoned in this way."
  },
  {
    "Id": "2a0ac01a-c23e-43b5-a497-7a4f932c6261",
    "Name": "Midnight Tears",
    "Type": "Ingested Poison",
    "Cost": "1,500 GP",
    "Effect": "A creature that ingests Midnight Tears suffers no effect until the stroke of midnight. Any effect that ends the Poisoned condition neutralizes this poison. If the poison hasn’t been neutralized before midnight, the creature makes a DC 17 Constitution saving throw, taking 31 (9d6) Poison damage on a failed save or half as much damage on a successful one."
  },
  {
    "Id": "5f70bd67-6358-47ed-90e0-512e1bfe9fab",
    "Name": "Oil of Taggit",
    "Type": "Contact Poison",
    "Cost": "400 GP",
    "Effect": "A creature subjected to Oil of Taggit must succeed on a DC 13 Constitution saving throw or have the Poisoned condition for 24 hours. The creature also has the Unconscious condition while Poisoned in this way. It wakes up if it takes damage."
  },
  {
    "Id": "2998a8eb-5a90-46f2-9dea-03db607f828c",
    "Name": "Pale Tincture",
    "Type": "Ingested Poison",
    "Cost": "250 GP",
    "Effect": "A creature subjected to Pale Tincture must succeed on a DC 16 Constitution saving throw or take 3 (1d6) Poison damage and have the Poisoned condition. The Poisoned creature repeats the save every 24 hours, taking 3 (1d6) Poison damage on a failed save. The damage the poison deals can’t be healed by any means while the creature remains Poisoned. After seven successful saves against the poison, the creature is no longer Poisoned."
  },
  {
    "Id": "f5582b21-6418-4323-9220-d6fd03c991c9",
    "Name": "Purple Worm Poison",
    "Type": "Injury Poison",
    "Cost": "2,000 GP",
    "Effect": "A creature subjected to Purple Worm Poison makes a DC 21 Constitution saving throw, taking 35 (10d6) Poison damage on a failed save or half as much damage on a successful one."
  },
  {
    "Id": "9775a433-9423-42a3-9d39-7bd87cd38094",
    "Name": "Serpent Venom",
    "Type": "Injury Poison",
    "Cost": "200 GP",
    "Effect": "A creature subjected to Serpent Venom must succeed on a DC 11 Constitution saving throw, taking 10 (3d6) Poison damage on a failed save or half as much damage on a successful one."
  },
  {
    "Id": "21b0795d-8d43-429e-816a-31f2c65928f9",
    "Name": "Torpor",
    "Type": "Ingested Poison",
    "Cost": "600 GP",
    "Effect": "A creature subjected to Torpor poison must succeed on a DC 15 Constitution saving throw or have the Poisoned condition for 4d6 hours. The creature’s Speed is halved while the creature is Poisoned in this way."
  },
  {
    "Id": "3a954daa-d6c6-4e34-adb7-6381125a9ff5",
    "Name": "Truth Serum",
    "Type": "Ingested Poison",
    "Cost": "150 GP",
    "Effect": "A creature subjected to Truth Serum must succeed on a DC 11 Constitution saving throw or have the Poisoned condition for 1 hour. The Poisoned creature can’t knowingly communicate a lie."
  },
  {
    "Id": "8d31c5ba-0d00-4593-8e63-a3579df4bfe1",
    "Name": "Wyvern Poison",
    "Type": "Injury Poison",
    "Cost": "1,200 GP",
    "Effect": "A creature subjected to Wyvern Poison makes a DC 14 Constitution saving throw, taking 24 (7d6) Poison damage on a failed save or half as much damage on a successful one."
  }
]