[
  {
    "Id": "e50589f7-2534-4e74-bca2-c7fc4ab9d1ac",
    "Name": "Alchemist",
    "ParentClass": "Artificer",
    "Source": "Eberron - Forge of the Artificer",
    "Description": "Craft Magic Elixirs and Potions\nAn Alchemist is an expert at combining reagents to produce magical effects. Alchemists use their creations to give life and to leech it away.\n\nYou gain the following benefits.",
    "FullContent": "\n\nSource: Eberron - Forge of the Artificer\nCraft Magic Elixirs and Potions\nAn Alchemist is an expert at combining reagents to produce magical effects. Alchemists use their creations to give life and to leech it away.\nLevel 3: Tools of the Trade\nYou gain the following benefits.\nTool Proficiency. You gain proficiency with Alchemist’s Supplies and the Herbalism Kit. If you already have one of these proficiencies, you gain proficiency with one other type of Artisan’s Tools of your choice (or with two other types if you have both).\nPotion Crafting. When you brew a potion using the crafting rules in the Dungeon Master’s Guide, the amount of time required to craft it is halved.\nLevel 3: Alchemist Spells.\nWhen you reach an Artificer level specified in the Alchemist Spells table, you thereafter always have the listed spells prepared.\nAlchemist Spells\n\n\nArtificer Level\nSpells\n\n\n3\nHealing Word, Ray of Sickness\n\n\n5\nFlaming Sphere, Melf\u0027s Acid Arrow\n\n\n9\nGaseous Form, Mass Healing Word\n\n\n13\nDeath Ward, Vitriolic Sphere\n\n\n17\nCloudkill, Raise Dead\n\n\nLevel 3: Experimental Elixir\nWhenever you finish a Long Rest while holding Alchemist’s Supplies, you can use that tool to magically produce two elixirs. For each elixir, roll on the Experimental Elixir table for the elixir’s effect, which is triggered when someone drinks the elixir. The elixir appears in a vial, and the vial vanishes when the elixir is drunk or poured out. If any elixir remains when you finish a Long Rest, the elixir and its vial vanish.\nDrinking an Elixir. As a Bonus Action, a creature can drink the elixir or administer it to another creature within 5 feet of itself.\nCreating Additional Elixirs. As a Magic action while holding Alchemist’s Supplies, you can expend one spell slot to create another elixir. When you do so, you choose its effect from the Experimental Elixir table rather than rolling.\nWhen you reach certain Artificer levels, you can make an additional elixir at the end of each Long Rest: a total of three at level 5, four at level 9, and five at level 15.\nExperimental Elixir\n\n\nD6\nEffect\n\n\n1\nHealing. The drinker regains a number of Hit Points equal to 2d8 plus your Intelligence modifier. The number of Hit Points restored increases by 1d8 when you reach Artificer levels 9 (3d8) and 15 (4d8).\n\n\n2\nSwiftness. The drinker’s Speed increases by 10 feet for 1 hour. This bonus increases when you reach Artificer levels 9 (15 feet) and 15 (20 feet).\n\n\n3\nResilience. The drinker gains a \u002B1 bonus to AC for 10 minutes. The duration increases when you reach Artificer levels 9 (1 hour) and 15 (8 hours).\n\n\n4\nBoldness. The drinker can roll 1d4 and add the number rolled to every attack roll and saving throw it makes for the next minute. The duration increases when you reach Artificer levels 9 (10 minutes) and 15 (1 hour).\n\n\n5\nFlight. The drinker gains a Fly Speed of 10 feet for 10 minutes. The Fly Speed increases when you reach Artificer levels 9 (20 feet) and 15 (30 feet).\n\n\n6\nYou determine the elixir’s effect by choosing one of the other rows in this table.\n\n\nLevel 5: Alchemical Savant\nWhenever you cast a spell using your Alchemist’s Supplies as the Spellcasting Focus, you gain a bonus to one roll of the spell. That roll must restore Hit Points or be a damage roll that deals Acid, Fire, or Poison damage. The bonus equals your Intelligence modifier (minimum bonus of \u002B1).\nLevel 9: Restorative Reagents\nYou can cast Lesser Restoration without expending a spell slot and without preparing the spell, provided you use Alchemist’s Supplies as the Spellcasting Focus. You can do so a number of times equal to your Intelligence modifier (minimum of once), and you regain all expended uses when you finish a Long Rest.\nLevel 15: Chemical Mastery\nYou gain the following benefits.\nAlchemical Eruption. When you cast an Artificer spell that deals Acid, Fire, or Poison damage to a target, you can also deal 2d8 Force damage to that target. You can use this benefit only once on each of your turns.\nChemical Resistance. You gain Resistance to Acid damage and Poison damage. You also gain Immunity to the Poisoned condition.\nConjured Cauldron. You can cast Tasha’s Bubbling Cauldron without expending a spell slot, without preparing the spell, and without Material components, provided you use Alchemist’s Supplies as the Spellcasting Focus. Once you use this feature, you can’t use it again until you finish a Long Rest.\n"
  },
  {
    "Id": "9f043dc9-fac4-4dc0-a3fe-fe24b397ecaf",
    "Name": "Armorer",
    "ParentClass": "Artificer",
    "Source": "Eberron - Forge of the Artificer",
    "Description": "Craft Magic Armor to Enhance Your Abilities\nAn Armorer modifies armor to function almost like a second skin. The armor is enhanced to hone the Armorer’s magic, unleash potent attacks, and generate a formidable defense.\n\nYou gain the following benefits.",
    "FullContent": "\n\nSource: Eberron - Forge of the Artificer\nCraft Magic Armor to Enhance Your Abilities\nAn Armorer modifies armor to function almost like a second skin. The armor is enhanced to hone the Armorer’s magic, unleash potent attacks, and generate a formidable defense.\nLevel 3: Tools of the Trade\nYou gain the following benefits.\nArmor Training. You gain training with Heavy armor.\nTool Proficiency. You gain proficiency with Smith’s Tools. If you already have this tool proficiency, you gain proficiency with one other type of Artisan’s Tools of your choice.\nArmor Crafting. When you craft nonmagical or magic armor, the amount of time required to craft it is halved.\nLevel 3: Armorer Spells\nWhen you reach an Artificer level specified in the Armorer Spells table, you thereafter always have the listed spells prepared.\nArmorer Spells\n\n\nArtificer Level\nSpells\n\n\n3\nMagic Missile, Thunderwave\n\n\n5\nMirror Image, Shatter\n\n\n9\nHypnotic Pattern, Lightning Bolt\n\n\n13\nFire Shield, Greater Invisibility\n\n\n17\nPasswall, Wall of Force\n\n\nLevel 3: Arcane Armor\nAs a Magic action while you have Smith’s Tools in hand, you can turn a suit of armor you are wearing into Arcane Armor. The armor continues to be Arcane Armor until you don another suit of armor or you die.\nYou gain the following benefits while wearing your Arcane Armor.\nNo Strength Requirement. If the armor normally has a Strength requirement, the Arcane Armor lacks this requirement for you.\nQuick Don and Doff. You can don or doff the armor as a Utilize action. The armor can’t be removed against your will.\nSpellcasting Focus. You can use the Arcane Armor as a Spellcasting Focus for your Artificer spells.\nLevel 3: Armor Model\nYou can customize your Arcane Armor. When you do so, choose one of the following armor models: Dreadnaught, Guardian, or Infiltrator. The model you choose gives you special benefits while you wear it.\nEach model includes a special weapon. When you attack with that weapon, you can add your Intelligence modifier, instead of your Strength or Dexterity modifier, to the attack and damage rolls.\nYou can change the armor’s model whenever you finish a Short or Long Rest if you have Smith’s Tools in hand.\nDreadnaught.\nYou design your armor to become a towering juggernaut in battle. It has the following features:\nForce Demolisher. An arcane wrecking ball or sledgehammer projects from your armor. The demolisher counts as a Simple Melee weapon with the Reach property, and it deals 1d10 Force damage on a hit. If you hit a creature that is at least one size smaller than you with the demolisher, you can push the creature up to 10 feet straight away from yourself or pull the creature up to 10 feet toward yourself.\nGiant Stature. As a Bonus Action, you transform and enlarge your armor for 1 minute. For the duration, your reach increases by 5 feet, and if you are smaller than Large, you become Large, along with anything you are wearing. If there isn’t enough room for you to increase your size, your size doesn’t change. You can use this Bonus Action a number of times equal to your Intelligence modifier (minimum of once). You regain all expended uses when you finish a Long Rest.\nGuardian.\nYou design your armor to be in the front line of conflict. It has the following features:\nThunder Pulse. You can discharge concussive blasts with strikes from your armor. The pulse counts as a Simple Melee weapon and deals 1d8 Thunder damage on a hit. A creature hit by the pulse has Disadvantage on attack rolls against targets other than you until the start of your next turn.\nDefensive Field. While Bloodied, you can take a Bonus Action to gain Temporary Hit Points equal to your Artificer level. You lose these Temporary Hit Points if you doff the armor.\nInfiltrator.\nYou customize your armor for subtler undertakings. It has the following features:\nLightning Launcher. A gemlike node appears on your armor, from which you can shoot bolts of lightning. The launcher counts as a Simple Ranged weapon with a normal range of 90 feet and a long range of 300 feet, and it deals 1d6 Lightning damage on a hit. Once on each of your turns when you hit a creature with the launcher, you can deal an extra 1d6 Lightning damage to that target.\nPowered Steps. Your Speed increases by 5 feet.\nDampening Field. You have Advantage on Dexterity (Stealth) checks. If the armor imposes Disadvantage on such checks, the Advantage and Disadvantage cancel each other, as normal.\nLevel 5: Extra Attack\nYou can attack twice instead of once whenever you take the Attack action on your turn.\nLevel 9: Improved Armorer\nYou gain the following benefits.\nArmor Replication. You learn an additional plan for your Replicate Magic Item feature, and it must be in the Armor category. If you replace that plan, you must replace it with another Armor plan.\nIn addition, you can create an additional item with that feature, and the item must also be in the Armor category.\nImproved Arsenal. You gain a \u002B1 bonus to attack and damage rolls made with the special weapon of your Arcane Armor model.\nLevel 15: Perfected Armor\nYour Arcane Armor gains additional benefits based on its model, as detailed below.\nDreadnaught. The damage die of your Force Demolisher increases to 2d6 Force damage.\nIn addition, when you use your Giant Stature, your reach increases by 10 feet, your size can increase to Large or Huge (your choice), and you have Advantage on Strength checks and Strength saving throws for the duration.\nGuardian. The damage die of your Thunder Pulse increases to 1d10 Thunder damage.\nIn addition, when a Huge or smaller creature you can see ends its turn within 30 feet of you, you can take a Reaction to magically force that creature to make a Strength saving throw against your spell save DC. On a failed save, you pull the creature up to 25 feet directly toward you to an unoccupied space. If you pull the target to a space within 5 feet of yourself, you can make a melee weapon attack against it as part of this Reaction.\nYou can take this Reaction a number of times equal to your Intelligence modifier (minimum of once), and you regain all expended uses when you finish a Long Rest.\nInfiltrator. The damage die of your Lightning Launcher increases to 2d6 Lightning damage. Any creature that takes Lightning damage from your Lightning Launcher glimmers with magical light until the start of your next turn. The glimmering creature sheds Dim Light in a 5-foot radius, and it has Disadvantage on attack rolls against you, as the light jolts it if it attacks you.\nAdditionally, as a Bonus Action, you can gain a Fly Speed equal to twice your Speed until the end of the current turn. You can take this Bonus Action a number of times equal to your Intelligence modifier (minimum of once), and you regain all expended uses when you finish a Long Rest.\n"
  },
  {
    "Id": "1e1f24b7-3b03-4c14-aa64-c33679cff264",
    "Name": "Artillerist",
    "ParentClass": "Artificer",
    "Source": "Eberron - Forge of the Artificer",
    "Description": "Wield Destructive Power from Afar\nAn Artillerist specializes in using magic to hurl energy, projectiles, and explosions on a battlefield.\n\nYou gain the following benefits.",
    "FullContent": "\n\nSource: Eberron - Forge of the Artificer\nWield Destructive Power from Afar\nAn Artillerist specializes in using magic to hurl energy, projectiles, and explosions on a battlefield.\nLevel 3: Tools of the Trade\nYou gain the following benefits.\nRanged Weaponry. You gain proficiency with Martial Ranged weapons.\nTool Proficiency. You gain proficiency with Woodcarver’s Tools. If you already have this proficiency, you gain proficiency with one other type of Artisan’s Tools of your choice.\nWand Crafting. When you craft a magic Wand, the amount of time required to craft it is halved.\nLevel 3: Artillerist Spells\nWhen you reach an Artificer level specified in the Artillerist Spells table, you thereafter always have the listed spells prepared.\nArtillerist Spells\n\n\nArtificer Level\nSpells\n\n\n3\nShield, Thunderwave\n\n\n5\nScorching Ray, Shatter\n\n\n9\nFireball, Wind Wall\n\n\n13\nIce Storm, Wall of Fire\n\n\n17\nCone of Cold, Wall of Force\n\n\nLevel 3: Eldritch Cannon\nUsing Smith’s Tools or Woodcarver’s Tools, you can take a Magic action to create a Small or Tiny Eldritch Cannon in an unoccupied space on a horizontal surface within 5 feet of yourself. The cannon’s game statistics appear below. You determine its appearance, including whether you carry it or not (and your choice of legs or wheels, for the latter). It disappears if it is reduced to 0 Hit Points or after 1 hour. You can dismiss it early as a Magic action.\nOnce you create a cannon, you can’t do so again until you finish a Long Rest or expend a spell slot to create one. You can have only one cannon at a time and can’t create one while you already have one.\n\n\nEldritch Cannon\n\n\nSmall or Tiny Object\n\n\nArmor Class: 18\n\n\nHit Points: 5 × your Artificer level (casting Mending on the cannon restores 2d6 Hit Points to it)\n\n\nImmunities: Poison, Psychic\n\n\nActivate Cannon (Requires You to be within 60 Feet of the Cannon): As a Bonus Action, you order the cannon to use the Flamethrower, Force Ballista, or Protector option below; you can direct the cannon to move up to 15 feet before or after that option:\n\n\nFlamethrower: The cannon exhales fire in a 15-foot Cone. Each creature in that area makes a Dexterity saving throw against your spell save DC, taking 2d8 Fire damage on a failed save or half as much damage on a successful one. Flammable objects in the Cone that aren’t being worn or carried start burning.\n\n\nForce Ballista: Make a ranged spell attack originating from the cannon at one creature or object within 120 feet of it. On a hit, the target takes 2d8 Force damage, and if the target is a creature, it is pushed up to 5 feet away from the cannon.\n\n\nProtector: The cannon emits a burst of positive energy that grants itself and each creature of your choice within 10 feet of it a number of Temporary Hit Points equal to 1d8 plus your Intelligence modifier (minimum of 1).\n\n\nLevel 5: Arcane Firearm\nWhen you finish a Long Rest, you can use Woodcarver’s Tools to carve special sigils into a Rod, Staff, Wand, or Martial Ranged weapon and thereby turn it into your Arcane Firearm. The sigils disappear from the object if you later carve them on a different item. The sigils otherwise last indefinitely.\nYou can use your Arcane Firearm as a Spellcasting Focus for your Artificer spells. When you cast an Artificer spell through the firearm, roll 1d8, and you gain a bonus to one of the spell’s damage rolls equal to the number rolled.\nLevel 9: Explosive Cannon\nEvery Eldritch Cannon you create is now more destructive. You gain the following benefits.\nDetonate. When your cannon takes damage, you can take a Reaction to command the cannon to detonate if you are within 60 feet of it. Doing so destroys the cannon and forces each creature within 20 feet of it to make a Dexterity saving throw against your spell save DC, taking 3d10 Force damage on a failed save or half as much damage on a successful one.\nFirepower. The cannon’s damage rolls and the number of Temporary Hit Points granted by Protector increase by 1d8.\nLevel 15: Fortified Position\nYou’re a master at forming well-defended emplacements using your Eldritch Cannon. You gain the following benefits.\nDouble Firepower. You can now have two cannons at the same time, and you can create two with the same Magic action. (If you expend a spell slot to create the first cannon, you must expend another spell slot to create the second.) You can activate both of them with the same Bonus Action, ordering them to use the same activation option or different ones. You can’t create a third cannon while you have two.\nShimmering Field Projection. You and your allies have Half Cover while within 10 feet of your Eldritch Cannon.\n"
  },
  {
    "Id": "b16f1f15-bb12-40ca-8bc8-20d9372fc358",
    "Name": "Battle Smith",
    "ParentClass": "Artificer",
    "Source": "Eberron - Forge of the Artificer",
    "Description": "Command a Construct Guardian\nA Battle Smith is a combination of protector and medic, an expert at defending others and repairing both materiel and personnel. To aid in their work, Battle Smiths are accompanied by a Steel Defender, a protective companion of their own creation.\n\nYou gain the following benefits.",
    "FullContent": "\n\nSource: Eberron - Forge of the Artificer\nCommand a Construct Guardian\nA Battle Smith is a combination of protector and medic, an expert at defending others and repairing both materiel and personnel. To aid in their work, Battle Smiths are accompanied by a Steel Defender, a protective companion of their own creation.\nLevel 3: Tools of the Trade\nYou gain the following benefits.\nTool Proficiency. You gain proficiency with Smith’s Tools. If you already have this proficiency, you gain proficiency with one other type of Artisan’s Tools of your choice.\nWeapon Crafting. When you craft a nonmagical or magic weapon, the amount of time required to craft it is halved.\nLevel 3: Battle Smith spells\nWhen you reach an Artificer level specified in the Battle Smith Spells table, you thereafter always have the listed spells prepared.\nBattle Smith Spells\n\n\nArtificer Level\nSpells\n\n\n3\nHeroism, Shield\n\n\n5\nShining Smite, Warding Bond\n\n\n9\nAura of Vitality, Conjure Barrage\n\n\n13\nAura of Purity, Fire Shield\n\n\n17\nBanishing Smite, Mass Cure Wounds\n\n\nLevel 3: Battle Ready\nYour combat training and your experiments with magic have paid off in two ways.\nArcane Empowerment. When you attack with a magic weapon, you can use your Intelligence modifier, instead of your Strength or Dexterity modifier, for the attack and damage rolls.\nWeapon Knowledge. You gain proficiency with Martial weapons. You can use a weapon with which you have proficiency as a Spellcasting Focus for your Artificer spells.\nLevel 3: Steel Defender\nYour tinkering has borne you a companion, a Steel Defender (see the stat block). You determine the defender’s appearance and whether it has two legs or four; your choices don’t affect the defender’s game statistics.\nThe defender is Friendly to you and your allies and obeys you. It vanishes if you die.\nThe Defender in Combat. In combat, the defender acts during your turn. It can move and take its Reaction on its own, but the only action it takes is the Dodge action unless you take a Bonus Action to command it to take an action. If you have the Incapacitated condition, the defender acts on its own and isn’t limited to the Dodge action.\nRestoring or Replacing the Defender. If the defender has died within the last hour, you can take a Magic action to touch it and expend a spell slot. The defender returns to life after 1 minute with all its Hit Points restored.\nWhenever you finish a Long Rest, you can create a new defender if you have Smith’s Tools in hand. If you already have a defender from this feature, the first one vanishes.\n\n\nSteel Defender\n\n\nMedium Construct\n\n\nArmor Class: 12 \u002B your Intelligence modifier\n\n\nHit Points: HP 5 \u002B five times your Artificer level (the defender has a number of Hit Dice [d8s] equal to your Artificer level)\n\n\nSpeed: Speed 40 ft.\n\n\nSTR (Mod/Save)\nDEX (Mod/Save)\nCON (Mod/Save)\nINT (Mod/Save)\nWIS (Mod/Save)\nCHA (Mod/Save)\n\n\n14 (\u002B2/\u002B2)\n12 (\u002B1/\u002B1)\n14 (\u002B2/\u002B2)\n4 (−3/-3)\n10 (\u002B0/\u002B0)\n6 (-2/-2)\n\n\nImmunities: Poison; Charmed, Exhaustion, Poisoned\n\n\nSenses: Darkvision 60 ft., Passive Perception 10\n\n\nLanguages: Understands the languages you know\n\n\nChallenge Rating: None (XP 0; PB equals your Proficiency Bonus)\n\n\nTraits\n\n\nSteel Bond. Add your Proficiency Bonus to any ability check or saving throw the Steel Defender makes.\n\n\nActions\n\n\nForce-Empowered Rend. Melee Attack Roll: Bonus equals your spell attack modifier, reach 5 ft. Hit: 1d8 \u002B 2 plus your Intelligence modifier Force damage.\n\n\nRepair (3/Day). The defender, or one Construct or object it can see within 5 feet of it, regains a number of Hit Points equal to 2d8 plus your Intelligence modifier.\n\n\nReactions\n\n\nDeflect Attack. Trigger: A creature the defender can see within 5 feet of it makes an attack roll targeting a different creature. Response: The triggering creature makes the attack roll with Disadvantage.\n\n\nLevel 5: Extra Attack\nYou can attack twice instead of once whenever you take the Attack action on your turn. You can forgo one of your attacks when you take the Attack action to command your Steel Defender to take the Force-Empowered Rend action.\nLevel 9: Arcane Jolt\nWhen either you hit a target with an attack roll using a magic weapon or your Steel Defender hits a target, you can channel magical energy through the strike to create one of the following effects:\nDestructive Energy. The target takes an extra 2d6 Force damage.\nRestorative Energy. Choose one creature or object you can see within 30 feet of the target. Healing energy flows into the chosen recipient, restoring 2d6 Hit Points to it.\nYou can use this energy a number of times equal to your Intelligence modifier (minimum of once), but you can do so no more than once per turn. You regain all expended uses when you finish a Long Rest.\nLevel 15: Improved Defender\nYour Arcane Jolt and Steel Defender have become more powerful, granting these benefits.\nImproved Jolt. The extra damage and healing of your Arcane Jolt both increase to 4d6.\nImproved Deflection. Whenever your Steel Defender uses its Deflect Attack, the attacker takes Force damage equal to 1d4 plus your Intelligence modifier.\n"
  },
  {
    "Id": "218043de-98fa-4b36-a943-6b187a481564",
    "Name": "Path of the Berserker",
    "ParentClass": "Barbarian",
    "Source": "Player\u0027s Handbook",
    "Description": "Channel Rage into Violent Fury\nBarbarians who walk the Path of the Berserker direct their Rage primarily toward violence. Their path is one of untrammeled fury, and they thrill in the chaos of battle as they allow their Rage to seize and empower them.\n\nIf you use Reckless Attack while your Rage is active, you deal extra damage to the first target you hit on your turn with a Strength-based attack. To determine the extra damage, roll a number of d6s equal to your Rage Damage bonus, and add them together. The damage has the same type as the weapon or Unarmed Strike used for the attack.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nChannel Rage into Violent Fury\nBarbarians who walk the Path of the Berserker direct their Rage primarily toward violence. Their path is one of untrammeled fury, and they thrill in the chaos of battle as they allow their Rage to seize and empower them.\nLevel 3: Frenzy\nIf you use Reckless Attack while your Rage is active, you deal extra damage to the first target you hit on your turn with a Strength-based attack. To determine the extra damage, roll a number of d6s equal to your Rage Damage bonus, and add them together. The damage has the same type as the weapon or Unarmed Strike used for the attack.\nLevel 6: Mindless Rage\nYou have Immunity to the Charmed and Frightened conditions while your Rage is active. If you\u0027re Charmed or Frightened when you enter your Rage, the condition ends on you.\nLevel 10: Retaliation\nWhen you take damage from a creature that is within 5 feet of you, you can take a Reaction to make one melee attack against that creature, using a weapon or an Unarmed Strike.\nLevel 14: Intimidating Presence\nAs a Bonus Action, you can strike terror into others with your menacing presence and primal power. When you do so, each creature of your choice in a 30-foot Emanation originating from you must make a Wisdom saving throw (DC 8 plus your Strength modifier and Proficiency Bonus). On a failed save, a creature has the Frightened condition for 1 minute. At the end of each of the Frightened creature\u0027s turns, the creature repeats the save, ending the effect on itself on a success.\nOnce you use this feature, you can\u0027t use it again until you finish a Long Rest unless you expend a use of your Rage (no action required) to restore your use of it.\n"
  },
  {
    "Id": "f72558f8-a9e5-47e1-9404-bd71ef7c84f3",
    "Name": "Path of the Wild Heart",
    "ParentClass": "Barbarian",
    "Source": "Player\u0027s Handbook",
    "Description": "Walk in Community with the Animal World\nBarbarians who follow the Path of the Wild Heart view themselves as kin to animals. These Barbarians learn magical means to communicate with animals, and their Rage heightens their connection to animals as it fills them with supernatural might.\n\nYou can cast the Beast Sense and Speak with Animals spells but only as Rituals. Wisdom is your spellcasting ability for them.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nWalk in Community with the Animal World\nBarbarians who follow the Path of the Wild Heart view themselves as kin to animals. These Barbarians learn magical means to communicate with animals, and their Rage heightens their connection to animals as it fills them with supernatural might.\nLevel 3: Animal Speaker\nYou can cast the Beast Sense and Speak with Animals spells but only as Rituals. Wisdom is your spellcasting ability for them.\nLevel 3: Rage of the Wilds\nYour Rage taps into the primal power of animals. Whenever you activate your Rage, you gain one of the following options of your choice.\nBear. While your Rage is active, you have Resistance to every damage type except Force, Necrotic, Psychic, and Radiant.\nEagle. When you activate your Rage, you can take the Disengage and Dash actions as part of that Bonus Action. While your Rage is active, you can take a Bonus Action to take both of those actions.\nWolf. While your Rage is active, your allies have Advantage on attack rolls against any enemy of yours within 5 feet of you.\nLevel 6: Aspect of the Wilds\nYou gain one of the following options of your choice. Whenever you finish a Long Rest, you can change your choice.\nOwl. You have Darkvision with a range of 60 feet. If you already have Darkvision, its range increases by 60 feet.\nPanther. You have a Climb Speed equal to your Speed.\nSalmon. You have a Swim Speed equal to your Speed.\nLevel 10: Nature Speaker\nYou can cast the Commune with Nature spell but only as a Ritual. Wisdom is your spellcasting ability for it.\nLevel 14: Power of the Wilds\nWhenever you activate your Rage, you gain one of the following options of your choice.\nFalcon. While your Rage is active, you have a Fly Speed equal to your Speed if you aren’t wearing any armor.\nLion. While your Rage is active, any of your enemies within 5 feet of you have Disadvantage on attack rolls against targets other than you or another Barbarian who has this option active.\nRam. While your Rage is active, you can cause a Large or smaller creature to have the Prone condition when you hit it with a melee attack.\n"
  },
  {
    "Id": "4d788db0-7d42-4fe0-8560-ac3fd64c1e5a",
    "Name": "Path of the World Tree",
    "ParentClass": "Barbarian",
    "Source": "Player\u0027s Handbook",
    "Description": "Trace the Roots and Branches of the Multiverse\nBarbarians who follow the Path of the World Tree connect with the cosmic tree Yggdrasil through their Rage. This tree grows among the Outer Planes, connecting them to each other and the Material Plane. These Barbarians draw on the tree’s magic for vitality and as a means of dimensional travel.\n\nYour Rage taps into the life force of the World Tree. You gain the following benefits.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nTrace the Roots and Branches of the Multiverse\nBarbarians who follow the Path of the World Tree connect with the cosmic tree Yggdrasil through their Rage. This tree grows among the Outer Planes, connecting them to each other and the Material Plane. These Barbarians draw on the tree’s magic for vitality and as a means of dimensional travel.\nLevel 3: Vitality of the Tree\nYour Rage taps into the life force of the World Tree. You gain the following benefits.\nVitality Surge. When you activate your Rage, you gain a number of Temporary Hit Points equal to your Barbarian level.\nLife-Giving Force. At the start of each of your turns while your Rage is active, you can choose another creature within 10 feet of yourself to gain Temporary Hit Points. To determine the number of Temporary Hit Points, roll a number of d6s equal to your Rage Damage bonus, and add them together. If any of these Temporary Hit Points remain when your Rage ends, they vanish.\nLevel 6: Branches of the Tree\nWhenever a creature you can see starts its turn within 30 feet of you while your Rage is active, you can take a Reaction to summon spectral branches of the World Tree around it. The target must succeed on a Strength saving throw (DC 8 plus your Strength modifier and Proficiency Bonus) or be teleported to an unoccupied space you can see within 5 feet of yourself or in the nearest unoccupied space you can see. After the target teleports, you can reduce its Speed to 0 until the end of the current turn.\nLevel 10: Battering Roots\nDuring your turn, your reach is 10 feet greater with any Melee weapon that has the Heavy or Versatile property, as tendrils of the World Tree extend from you. When you hit with such a weapon on your turn, you can activate the Push or Topple mastery property in addition to a different mastery property you\u0027re using with that weapon.\nLevel 14: Travel along the Tree\nWhen you activate your Rage and as a Bonus Action while your Rage is active, you can teleport up to 60 feet to an unoccupied space you can see. In addition, once per Rage, you can increase the range of that teleport to 150 feet. When you do so, you can also bring up to six willing creatures who are within 10 feet of you. Each creature teleports to an unoccupied space of your choice within 10 feet of your destination space.\n"
  },
  {
    "Id": "434049a7-7c26-4c3e-901b-756d8aa9a617",
    "Name": "Path of the Zealot",
    "ParentClass": "Barbarian",
    "Source": "Player\u0027s Handbook",
    "Description": "Rage in Ecstatic Union with a God\nBarbarians who walk the Path of the Zealot receive boons from a god or pantheon. These Barbarians experience their Rage as an ecstatic episode of divine union that infuses them with power. They are often allies to the priests and other followers of their god or pantheon.\n\nYou can channel divine power into your strikes. On each of your turns while your Rage is active, the first creature you hit with a weapon or an Unarmed Strike takes extra damage equal to 1d6 plus half your Barbarian level (round down). The extra damage is Necrotic or Radiant; you choose the type each time you deal the damage.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nRage in Ecstatic Union with a God\nBarbarians who walk the Path of the Zealot receive boons from a god or pantheon. These Barbarians experience their Rage as an ecstatic episode of divine union that infuses them with power. They are often allies to the priests and other followers of their god or pantheon.\nLevel 3: Divine Fury\nYou can channel divine power into your strikes. On each of your turns while your Rage is active, the first creature you hit with a weapon or an Unarmed Strike takes extra damage equal to 1d6 plus half your Barbarian level (round down). The extra damage is Necrotic or Radiant; you choose the type each time you deal the damage.\nLevel 3: Warrior of the Gods\nA divine entity helps ensure you can continue the fight. You have a pool of four d12s that you can spend to heal yourself. As a Bonus Action, you can expend dice from the pool, roll them, and regain a number of Hit Points equal to the roll’s total.\nYour pool regains all expended dice when you finish a Long Rest.\nThe pool\u0027s maximum number of dice increases by one when you reach Barbarian levels 6 (5 dice), 12 (6 dice), and 17 (7 dice).\nLevel 6: Fanatical Focus\nOnce per active Rage, if you fail a saving throw, you can reroll it with a bonus equal to your Rage Damage bonus, and you must use the new roll.\nLevel 10: Zealous Presence\nAs a Bonus Action, you unleash a battle cry infused with divine energy. Up to ten other creatures of your choice within 60 feet of you gain Advantage on attack rolls and saving throws until the start of your next turn.\nOnce you use this feature, you can’t use it again until you finish a Long Rest unless you expend a use of your Rage (no action required) to restore your use of it.\nLevel 14: Rage of the Gods\nWhen you activate your Rage, you can assume the form of a divine warrior. This form lasts for 1 minute or until you drop to 0 Hit Points. Once you use this feature, you can\u0027t do so again until you finish a Long Rest.\nWhile in this form, you gain the benefits below.\nFlight. You have a Fly Speed equal to your Speed and can hover.\nResistance. You have Resistance to Necrotic, Psychic, and Radiant damage.\nRevivification. When a creature within 30 feet of you would drop to 0 Hit Points, you can take a Reaction to expend a use of your Rage to instead change the target’s Hit Points to a number equal to your Barbarian level.\n"
  },
  {
    "Id": "58ac0229-5202-46cf-b652-9caf63b0ba7c",
    "Name": "College of Dance",
    "ParentClass": "Bard",
    "Source": "Player\u0027s Handbook",
    "Description": "Move in Harmony with the Cosmos\nBards of the College of Dance know that the Words of Creation can\u0027t be contained within speech or song; the words are uttered by the movements of celestial bodies and flow through the motions of the smallest creatures. These Bards practice a way of being in harmony with the whirling cosmos that emphasizes agility, speed, and grace.\n\nWhile you aren’t wearing armor or wielding a Shield, you gain the following benefits.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nMove in Harmony with the Cosmos\nBards of the College of Dance know that the Words of Creation can\u0027t be contained within speech or song; the words are uttered by the movements of celestial bodies and flow through the motions of the smallest creatures. These Bards practice a way of being in harmony with the whirling cosmos that emphasizes agility, speed, and grace.\nLevel 3: Dazzling Footwork\nWhile you aren’t wearing armor or wielding a Shield, you gain the following benefits.\nDance Virtuoso. You have Advantage on any Charisma (Performance) check you make that involves you dancing.\nUnarmored Defense. Your base Armor Class equals 10 plus your Dexterity and Charisma modifiers.\nAgile Strikes. When you expend a use of your Bardic Inspiration as part of an action, a Bonus Action, or a Reaction, you can make one Unarmed Strike as part of that action, Bonus Action, or Reaction.\nBardic Damage. You can use Dexterity instead of Strength for the attack rolls of your Unarmed Strikes. When you deal damage with an Unarmed Strike, you can deal Bludgeoning damage equal to a roll of your Bardic Inspiration die plus your Dexterity modifier, instead of the strike’s normal damage. This roll doesn\u0027t expend the die.\nLevel 6: Inspiring Movement\nWhen an enemy you can see ends its turn within 5 feet of you, you can take a Reaction and expend one use of your Bardic Inspiration to move up to half your Speed. Then one ally of your choice within 30 feet of you can also move up to half their Speed using their Reaction.\nNone of this feature’s movement provokes Opportunity Attacks.\nLevel 6: Tandem Footwork\nWhen you roll Initiative, you can expend one use of your Bardic Inspiration if you don\u0027t have the Incapacitated condition. When you do so, roll your Bardic Inspiration die; you and each ally within 30 feet of you who can see or hear you gains a bonus to Initiative equal to the number rolled.\nLevel 14: Leading Evasion\nWhen you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw and only half damage if you fail. If any creatures within 5 feet of you are making the same Dexterity saving throw, you can share this benefit with them for that save.\nYou can’t use this feature if you have the Incapacitated condition.\n"
  },
  {
    "Id": "95255a9d-e94f-4106-af8b-fc547390fe5f",
    "Name": "College of Glamour",
    "ParentClass": "Bard",
    "Source": "Player\u0027s Handbook",
    "Description": "Weave Beguiling Fey Magic\nThe College of Glamour traces its origins to the beguiling magic of the Feywild. Bards who study this magic weave threads of beauty and terror into their songs and stories, and the mightiest among them can cloak themselves in otherworldly majesty. Their performances stir up wistful longing for forgotten innocence, evoke unconscious memories of longheld fears, and tug at the emotions of even the most hard-hearted listeners.\n\nYou always have the Charm Person and Mirror Image spells prepared.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nWeave Beguiling Fey Magic\nThe College of Glamour traces its origins to the beguiling magic of the Feywild. Bards who study this magic weave threads of beauty and terror into their songs and stories, and the mightiest among them can cloak themselves in otherworldly majesty. Their performances stir up wistful longing for forgotten innocence, evoke unconscious memories of longheld fears, and tug at the emotions of even the most hard-hearted listeners.\nLevel 3: Beguiling Magic\nYou always have the Charm Person and Mirror Image spells prepared.\nIn addition, immediately after you cast an Enchantment or Illusion spell using a spell slot, you can cause a creature you can see within 60 feet of yourself to make a Wisdom saving throw against your spell save DC. On a failed save, the target has the Charmed or Frightened condition (your choice) for 1 minute. The target repeats the save at the end of each of its turns, ending the effect on itself on a success.\nOnce you use this benefit, you can’t use it again until you finish a Long Rest. You can also restore your use of it by expending one use of your Bardic Inspiration (no action required).\nLevel 3: Mantle of Inspiration\nYou can weave fey magic into a song or dance to fill others with vigor. As a Bonus Action, you can expend a use of Bardic Inspiration, rolling a Bardic Inspiration die. When you do so, choose a number of other creatures within 60 feet of yourself, up to a number equal to your Charisma modifier (minimum of one creature). Each of those creatures gains a number of Temporary Hit Points equal to two times the number rolled on the Bardic Inspiration die, and then each can use its Reaction to move up to its Speed without provoking Opportunity Attacks.\nLevel 6: Mantle of Majesty\nYou always have the Command spell prepared.\nAs a Bonus Action, you cast Command without expending a spell slot, and you take on an unearthly appearance for 1 minute or until your Concentration ends. During this time, you can cast Command as a Bonus Action without expending a spell slot,\nAny creature Charmed by you automatically fails its saving throw against the Command you cast with this feature.\nOnce you use this feature, you can’t use it again until you finish a Long Rest. You can also restore your use of it by expending a level 3\u002B spell slot (no action required).\nLevel 14: Unbreakable Majesty\nAs a Bonus Action, you can assume a magically majestic presence for 1 minute or until you have the Incapacitated condition. For the duration, whenever any creature hits you with an attack roll for the first time on a turn, the attacker must succeed on a Charisma saving throw against your spell save DC, or the attack misses instead, as the creature recoils from your majesty.\nOnce you assume this majestic presence, you can\u0027t do so again until you finish a Short or Long Rest.\n"
  },
  {
    "Id": "27069df9-6f0b-4a3b-8ab1-cb35e739930b",
    "Name": "College of Lore",
    "ParentClass": "Bard",
    "Source": "Player\u0027s Handbook",
    "Description": "Plumb the Depths of Magical Knowledge\nBards of the College of Lore collect spells and secrets from diverse sources, such as scholarly tomes, mystical rites, and peasant tales. The college’s members gather in libraries and universities to share their lore with one another. They also meet at festivals or affairs of state, where they can expose corruption, unravel lies, and poke fun at self-important figures of authority.\n\nYou gain proficiency with three skills of your choice.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nPlumb the Depths of Magical Knowledge\nBards of the College of Lore collect spells and secrets from diverse sources, such as scholarly tomes, mystical rites, and peasant tales. The college’s members gather in libraries and universities to share their lore with one another. They also meet at festivals or affairs of state, where they can expose corruption, unravel lies, and poke fun at self-important figures of authority.\nLevel 3: Bonus Proficiencies\nYou gain proficiency with three skills of your choice.\nLevel 3: Cutting Words\nYou learn to use your wit to supernaturally distract, confuse, and otherwise sap the confidence and competence of others. When a creature that you can see within 60 feet of yourself makes a damage roll or succeeds on an ability check or attack roll, you can take a Reaction to expend one use of your Bardic Inspiration; roll your Bardic Inspiration die, and subtract the number rolled from the creature\u0027s roll, reducing the damage or potentially turning the success into a failure.\nLevel 6: Magical Discoveries\nYou learn two spells of your choice. These spells can come from the Cleric, Druid, or Wizard spell list or any combination thereof (see a class’s section for its spell list). A spell you choose must be a cantrip or a spell for which you have spell slots, as shown in the Bard Features table.\nYou always have the chosen spells prepared, and whenever you gain a Bard level, you can replace one of the spells with another spell that meets these requirements.\nLevel 14: Peerless Skill\nWhen you make an ability check or attack roll and fail, you can expend one use of Bardic Inspiration; roll the Bardic Inspiration die, and add the number rolled to the d20, potentially turning a failure into a success. On a failure, the Bardic Inspiration isn’t expended.\n"
  },
  {
    "Id": "bbd9d413-a4a4-4fb8-b738-fa11c6bb66ae",
    "Name": "College of Valor",
    "ParentClass": "Bard",
    "Source": "Player\u0027s Handbook",
    "Description": "Sing the Deeds of Ancient Heroes\nBards of the College of Valor are daring storytellers whose tales preserve the memory of the great heroes of the past. These Bards sing the deeds of the mighty in vaulted halls or to crowds gathered around great bonfires. They travel to witness great events firsthand and to ensure that the memory of these events doesn’t pass away. With their songs, they inspire new generations to reach the same heights of accomplishment as the heroes of old.\n\nYou can use your wit to turn the tide of battle. A creature that has a Bardic Inspiration die from you can use it for one of the following effects.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nSing the Deeds of Ancient Heroes\nBards of the College of Valor are daring storytellers whose tales preserve the memory of the great heroes of the past. These Bards sing the deeds of the mighty in vaulted halls or to crowds gathered around great bonfires. They travel to witness great events firsthand and to ensure that the memory of these events doesn’t pass away. With their songs, they inspire new generations to reach the same heights of accomplishment as the heroes of old.\nLevel 3: Combat Inspiration\nYou can use your wit to turn the tide of battle. A creature that has a Bardic Inspiration die from you can use it for one of the following effects.\nDefense. When the creature is hit by an attack roll, that creature can use its Reaction to roll the Bardic Inspiration die and add the number rolled to its AC against that attack, potentially causing the attack to miss.\nOffense. Immediately after the creature hits a target with an attack roll, the creature can roll the Bardic Inspiration die and add the number rolled to the attack’s damage against the target.\nLevel 3: Martial Training\nYou gain proficiency with Martial weapons and training with Medium armor and Shields.\nIn addition, you can use a Simple or Martial weapon as a Spellcasting Focus to cast spells from your Bard spell list.\nLevel 6: Extra Attack\nYou can attack twice instead of once whenever you take the Attack action on your turn.\nIn addition, you can cast one of your cantrips that has a casting time of an action in place of one of those attacks.\nLevel 14: Battle Magic\nAfter you cast a spell that has a casting time of an action, you can make one attack with a weapon as a Bonus Action.\n"
  },
  {
    "Id": "288dbe78-53c9-4625-8d93-23b02ca20ef9",
    "Name": "Life Domain",
    "ParentClass": "Cleric",
    "Source": "Player\u0027s Handbook",
    "Description": "Soothe the Hurts of the World\n\nThe Life Domain focuses on the positive energy that helps sustain all life in the multiverse. Clerics who tap into this domain are masters of healing, using that life force to cure many hurts.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nSoothe the Hurts of the World\nThe Life Domain focuses on the positive energy that helps sustain all life in the multiverse. Clerics who tap into this domain are masters of healing, using that life force to cure many hurts.\nExistence itself relies on the positive energy associated with this domain, so a Cleric of almost any religious tradition might choose it. This domain is particularly associated with agricultural deities, gods of healing or endurance, and gods of home and community. Religious orders of healing also seek the magic of this domain.\nLevel 3: Disciple of Life\nWhen a spell you cast with a spell slot restores Hit Points to a creature, that creature regains additional Hit Points on the turn you cast the spell. The additional Hit Points equal 2 plus the spell slot’s level.\nLevel 3: Life Domain Spells\nYour connection to this divine domain ensures you always have certain spells ready. When you reach a Cleric level specified in the Life Domain Spells table, you thereafter always have the listed spells prepared.\nLife Domain Spells\n\n\nCleric Level\nPrepared Spells\n\n\n3\nAid, Bless, Cure Wounds, Lesser Restoration\n\n\n5\nMass Healing Word, Revivify\n\n\n7\nAura of Life, Death Ward\n\n\n9\nGreater Restoration, Mass Cure Wounds\n\n\nLevel 3: Preserve Life\nAs a Magic action, you present your Holy Symbol and expend a use of your Channel Divinity to evoke healing energy that can restore a number of Hit Points equal to five times your Cleric level. Choose Bloodied creatures within 30 feet of yourself (which can include you), and divide those Hit Points among them. This feature can restore a creature to no more than half its Hit Point maximum.\nLevel 6: Blessed Healer\nThe healing spells you cast on others heal you as well. Immediately after you cast a spell with a spell slot that restores Hit Points to one or more creatures other than yourself, you regain Hit Points equal to 2 plus the spell slot’s level.\nLevel 17: Supreme Healing\nWhen you would normally roll one or more dice to restore Hit Points to a creature with a spell or Channel Divinity, don’t roll those dice for the healing; instead use the highest number possible for each die. For example, instead of restoring 2d6 Hit Points to a creature with a spell, you restore 12.\n"
  },
  {
    "Id": "b03a5929-bffb-4f06-a6de-1d4ca16c4d11",
    "Name": "Light Domain",
    "ParentClass": "Cleric",
    "Source": "Player\u0027s Handbook",
    "Description": "Bring Light to Banish Darkness\n\nThe Light Domain emphasizes the divine power to bring about blazing fire and revelation. Clerics who wield this power are enlightened souls infused with radiance and the power of their deities’ discerning vision, charged with chasing away lies and burning away darkness.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nBring Light to Banish Darkness\nThe Light Domain emphasizes the divine power to bring about blazing fire and revelation. Clerics who wield this power are enlightened souls infused with radiance and the power of their deities’ discerning vision, charged with chasing away lies and burning away darkness.\nThe Light Domain is associated with gods of truth, vigilance, beauty, insight, and renewal. Some of these gods are identified with the sun or as charioteers who guide the sun across the sky. Others are sentinels who pierce deception. Some are deities of beauty and artistry who teach that art is a vehicle for the soul’s improvement.\nLevel 3: Light Domain Spells\nYour connection to this divine domain ensures you always have certain spells ready. When you reach a Cleric level specified in the Light Domain Spells table, you thereafter always have the listed spells prepared.\nLight Domain Spells\n\n\nCleric Level\nPrepared Spells\n\n\n3\nBurning Hands, Faerie Fire, Scorching Ray, See Invisibility\n\n\n5\nDaylight, Fireball\n\n\n7\nArcane Eye, Wall of Fire\n\n\n9\nFlame Strike, Scrying\n\n\nLevel 3: Radiance of the Dawn\nAs a Magic action, you present your Holy Symbol and expend a use of your Channel Divinity to emit a flash of light in a 30-foot Emanation originating from yourself. Any magical Darkness—such as that created by the Darkness spell—in that area is dispelled. Additionally, each creature of your choice in that area must make a Constitution saving throw, taking Radiant damage equal to 2d10 plus your Cleric level on a failed save or half as much damage on a successful one.\nLevel 3: Warding Flare\nWhen a creature that you can see within 30 feet of yourself makes an attack roll, you can take a Reaction to impose Disadvantage on the attack roll, causing light to flare before it hits or misses.\nYou can use this feature a number of times equal to your Wisdom modifier (minimum of once). You regain all expended uses when you finish a Long Rest.\nLevel 6: Improved Warding Flare\nYou regain all expended uses of your Warding Flare when you finish a Short or Long Rest.\nIn addition, whenever you use Warding Flare, you can give the target of the triggering attack a number of Temporary Hit Points equal to 2d6 plus your Wisdom modifier.\nLevel 17: Corona of Light\nAs a Magic action, you cause yourself to emit an aura of sunlight that lasts for 1 minute or until you dismiss it (no action required). You emit Bright Light in a 60-foot radius and Dim Light for an additional 30 feet. Your enemies in the Bright Light have Disadvantage on saving throws against your Radiance of the Dawn and any spell that deals Fire or Radiant damage.\nYou can use this feature a number of times equal to your Wisdom modifier (minimum of once), and you regain all expended uses when you finish a Long Rest.\n"
  },
  {
    "Id": "7854880b-c8d2-428d-ac9c-383cf9b30061",
    "Name": "Trickery Domain",
    "ParentClass": "Cleric",
    "Source": "Player\u0027s Handbook",
    "Description": "Make Mischief and Challenge Authority\n\nThe Trickery Domain offers magic of deception, illusion, and stealth. Clerics who wield this magic are a disruptive force in the world, puncturing pride, mocking tyrants, freeing captives, and flouting hollow traditions. They prefer subterfuge and pranks to direct confrontation.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nMake Mischief and Challenge Authority\nThe Trickery Domain offers magic of deception, illusion, and stealth. Clerics who wield this magic are a disruptive force in the world, puncturing pride, mocking tyrants, freeing captives, and flouting hollow traditions. They prefer subterfuge and pranks to direct confrontation.\nGods of trickery are mischief-makers and instigators who stand as a constant challenge to the accepted order among both gods and mortals. They embody the forces of change and social upheaval, and they’re patrons of thieves, scoundrels, gamblers, rebels, and liberators. Religious orders that operate in secret, especially those that seek to undermine oppressive governments or hierarchies, also draw on the power of the Trickery Domain.\nLevel 3: Blessing of the Trickster\nAs a Magic action, you can choose yourself or a willing creature within 30 feet of yourself to have Advantage on Dexterity (Stealth) checks. This blessing lasts until you finish a Long Rest or you use this feature again.\nLevel 3: Trickery Domain Spells\nYour connection to this divine domain ensures you always have certain spells ready. When you reach a Cleric level specified in the Trickery Domain Spells table, you thereafter always have the listed spells prepared.\nTrickery Domain Spells\n\n\nCleric Level\nPrepared Spells\n\n\n3\nCharm Person, Disguise Self, Invisibility, Pass without Trace\n\n\n5\nHypnotic Pattern, Nondetection\n\n\n7\nConfusion, Dimension Door\n\n\n9\nDominate Person, Modify Memory\n\n\nLevel 3: Invoke Duplicity\nAs a Bonus Action, you can expend one use of your Channel Divinity to create a perfect visual illusion of yourself in an unoccupied space you can see within 30 feet of yourself. The illusion is intangible and doesn’t occupy its space. It lasts for 1 minute, but it ends early if you dismiss it (no action required) or have the Incapacitated condition. The illusion is animated and mimics your expressions and gestures. While it persists, you gain the following benefits.\nCast Spells. You can cast spells as though you were in the illusion’s space, but you must use your own senses.\nDistract. When both you and your illusion are within 5 feet of a creature that can see the illusion, you have Advantage on attack rolls against that creature, given how distracting the illusion is to the target.\nMove. As a Bonus Action, you can move the illusion up to 30 feet to an unoccupied space you can see that is within 120 feet of yourself.\nLevel 6: Trickster’s Transposition\nWhenever you take the Bonus Action to create or move the illusion of your Invoke Duplicity, you can teleport, swapping places with the illusion.\nLevel 17: Improved Duplicity\nThe illusion of your Invoke Duplicity has grown more powerful in the following ways.\nShared Distraction. When you and your allies make attack rolls against a creature within 5 feet of the illusion, the attack rolls have Advantage.\nHealing Illusion. When the illusion ends, you or a creature of your choice within 5 feet of it regains a number of Hit Points equal to your Cleric level.\n"
  },
  {
    "Id": "46aff8bb-e578-4174-bfe3-788a204c21d9",
    "Name": "War Domain",
    "ParentClass": "Cleric",
    "Source": "Player\u0027s Handbook",
    "Description": "Inspire Valor and Smite Foes\n\nWar has many manifestations. It can make heroes of ordinary people. It can be desperate and horrific, with acts of cruelty and cowardice eclipsing instances of excellence and courage. Clerics who tap into the magic of the War Domain excel in battle, inspiring others to fight the good fight or offering acts of violence as prayers.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nInspire Valor and Smite Foes\nWar has many manifestations. It can make heroes of ordinary people. It can be desperate and horrific, with acts of cruelty and cowardice eclipsing instances of excellence and courage. Clerics who tap into the magic of the War Domain excel in battle, inspiring others to fight the good fight or offering acts of violence as prayers.\nGods of the War Domain watch over warriors and reward them for their great deeds. They include champions of honor and chivalry as well as gods of destruction and pillage. Other war gods take a more neutral stance, promoting war in all its manifestations and supporting warriors in any circumstance.\nLevel 3: Guided Strike\nWhen you or a creature within 30 feet of you misses with an attack roll, you can expend one use of your Channel Divinity and give that roll a \u002B10 bonus, potentially causing it to hit. When you use this feature to benefit another creature’s attack roll, you must take a Reaction to do so.\nLevel 3: War Domain Spells\nYour connection to this divine domain ensures you always have certain spells ready. When you reach a Cleric level specified in the War Domain Spells table, you thereafter always have the listed spells prepared.\nWar Domain Spells\n\n\nCleric Level\nPrepared Spells\n\n\n3\nGuiding Bolt, Magic Weapon, Shield of Faith, Spiritual Weapon\n\n\n5\nCrusader\u0027s Mantle, Spirit Guardians\n\n\n7\nFire Shield, Freedom of Movement\n\n\n9\nHold Monster, Steel Wind Strike\n\n\nLevel 3: War Priest\nAs a Bonus Action, you can make one attack with a weapon or an Unarmed Strike. You can use this Bonus Action a number of times equal to your Wisdom modifier (minimum of once). You regain all expended uses when you finish a Short or Long Rest.\nLevel 6: War God’s Blessing\nYou can expend a use of your Channel Divinity to cast Shield of Faith or Spiritual Weapon rather than expending a spell slot. When you cast either spell in this way, the spell doesn’t require Concentration. Instead the spell lasts for 1 minute, but it ends early if you cast that spell again, have the Incapacitated condition, or die.\nLevel 17: Avatar of Battle\nYou gain Resistance to Bludgeoning, Piercing, and Slashing damage.\n"
  },
  {
    "Id": "a904c0fc-4736-487e-809e-0b30998b4ec7",
    "Name": "Circle of the Land",
    "ParentClass": "Druid",
    "Source": "Player\u0027s Handbook",
    "Description": "Celebrate Connection to the Natural World\n\nThe Circle of the Land comprises mystics and sages who safeguard ancient knowledge and rites. These Druids meet within sacred circles of trees or standing stones to whisper primal secrets in Druidic. The circle’s wisest members preside as the chief priests of their communities.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nCelebrate Connection to the Natural World\nThe Circle of the Land comprises mystics and sages who safeguard ancient knowledge and rites. These Druids meet within sacred circles of trees or standing stones to whisper primal secrets in Druidic. The circle’s wisest members preside as the chief priests of their communities.\nLevel 3: Circle of the Land Spells\nWhenever you finish a Long Rest, choose one type of land: arid, polar, temperate, or tropical. Consult the table below that corresponds to the chosen type; you have the spells listed for your Druid level and lower prepared.\nArid Land\n\n\nDruid Level\nCircle Spells\n\n\n3\nBlur, Burning Hands, Fire Bolt\n\n\n5\nFireball\n\n\n7\nBlight\n\n\n9\nWall of Stone\n\n\nPolar Land\n\n\nDruid Level\nCircle Spells\n\n\n3\nFog Cloud, Hold Person, Ray of Frost\n\n\n5\nSleet Storm\n\n\n7\nIce Storm\n\n\n9\nCone of Cold\n\n\nTemperate Land\n\n\nDruid Level\nCircle Spells\n\n\n3\nMisty Step, Shocking Grasp, Sleep\n\n\n5\nLightning Bolt\n\n\n7\nFreedom of Movement\n\n\n9\nTree Stride\n\n\nTropical Land\n\n\nDruid Level\nCircle Spells\n\n\n3\nAcid Splash, Ray of Sickness, Web\n\n\n5\nStinking Cloud\n\n\n7\nPolymorph\n\n\n9\nInsect Plague\n\n\nLevel 3: Land’s Aid\nAs a Magic action, you can expend a use of your Wild Shape and choose a point within 60 feet of yourself. Vitality-giving flowers and life-draining thorns appear for a moment in a 10-foot-radius Sphere centered on that point. Each creature of your choice in the Sphere must make a Constitution saving throw against your spell save DC, taking 2d6 Necrotic damage on a failed save or half as much damage on a successful one. One creature of your choice in that area regains 2d6 Hit Points.\nThe damage and healing increase by 1d6 when you reach Druid levels 10 (3d6) and 14 (4d6).\nLevel 6: Natural Recovery\nYou can cast one of the level 1\u002B spells that you have prepared from your Circle Spells feature without expending a spell slot, and you must finish a Long Rest before you do so again.\nIn addition, when you finish a Short Rest, you can choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your Druid level (round up), and none of them can be level 6\u002B. For example, if you’re a level 6 Druid, you can recover up to three levels’ worth of spell slots. You can recover a level 3 spell slot, a level 2 and a level 1 spell slot, or three level 1 spell slots. Once you recover spell slots with this feature, you can’t do so again until you finish a Long Rest.\nLevel 10: Nature’s Ward\nYou are immune to the Poisoned condition, and you have Resistance to a damage type associated with your current land choice in the Circle Spells feature, as shown in the Nature’s Ward table.\nNature\u0027s Ward\n\n\nLand Type\nResistance\n\n\nArid\nFire\n\n\nPolar\nCold\n\n\nTemperate\nLightning\n\n\nTropical\nPoison\n\n\nLevel 14: Nature’s Sanctuary\nAs a Magic action, you can expend a use of your Wild Shape and cause spectral trees and vines to appear in a 15-foot Cube on the ground within 120 feet of yourself. They last there for 1 minute or until you have the Incapacitated condition or die. You and your allies have Half Cover while in that area, and your allies gain the current Resistance of your Nature’s Ward while there.\nAs a Bonus Action, you can move the Cube up to 60 feet to ground within 120 feet of yourself.\n"
  },
  {
    "Id": "b4d6158c-9f99-4395-937f-f4505912daf4",
    "Name": "Circle of the Moon",
    "ParentClass": "Druid",
    "Source": "Player\u0027s Handbook",
    "Description": "Adopt Animal Forms to Guard the Wilds\n\nDruids of the Circle of the Moon draw on lunar magic to transform themselves. Their order gathers under the moon to share news and perform rituals.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nAdopt Animal Forms to Guard the Wilds\nDruids of the Circle of the Moon draw on lunar magic to transform themselves. Their order gathers under the moon to share news and perform rituals.\nChangeable as the moon, a Druid of this circle might prowl as a great cat one night, soar over the treetops as an eagle the next day, and then crash through undergrowth as a bear to drive off a trespassing monster. The wild is in the Druid’s blood.\nLevel 3: Circle Forms\nYou can channel lunar magic when you assume a Wild Shape form, granting you the benefits below.\nChallenge Rating. The maximum Challenge Rating for the form equals your Druid level divided by 3 (round down).\nArmor Class. Until you leave the form, your AC equals 13 plus your Wisdom modifier if that total is higher than the Beast’s AC.\nTemporary Hit Points. You gain a number of Temporary Hit Points equal to three times your Druid level.\nLevel 3: Circle of the Moon Spells\nWhen you reach a Druid level specified in the Circle of the Moon Spells table, you thereafter always have the listed spells prepared.\nIn addition, you can cast the spells from this feature while you’re in a Wild Shape form.\nCircle of the Moon Spells\n\n\nDruid Level\nPrepared Spells\n\n\n3\nCure Wounds, Moonbeam, Starry Wisp\n\n\n5\nConjure Animals\n\n\n7\nFount of Moonlight\n\n\n9\nMass Cure Wounds\n\n\nLevel 6: Improved Circle Forms\nWhile in a Wild Shape form, you gain the following benefits.\nLunar Radiance. Each of your attacks in a Wild Shape form can deal its normal damage type or Radiant damage. You make this choice each time you hit with those attacks.\nIncreased Toughness. You can add your Wisdom modifier to your Constitution saving throws.\nLevel 10: Moonlight Step\nYou magically transport yourself, reappearing amid a burst of moonlight. As a Bonus Action, you teleport up to 30 feet to an unoccupied space you can see, and you have Advantage on the next attack roll you make before the end of this turn.\nYou can use this feature a number of times equal to your Wisdom modifier (minimum of once), and you regain all expended uses when you finish a Long Rest. You can also regain uses by expending a level 2\u002B spell slot for each use you want to restore (no action required).\nLevel 14: Lunar Form\nThe power of the moon suffuses you, granting you the following benefits.\nImproved Lunar Radiance. Once per turn, you can deal an extra 2d10 Radiant damage to a target you hit with a Wild Shape form’s attack.\nShared Moonlight. Whenever you use Moonlight Step, you can also teleport one willing creature. That creature must be within 10 feet of you, and you teleport it to an unoccupied space you can see within 10 feet of your destination space.\n"
  },
  {
    "Id": "ac361d2e-f56c-4119-b235-a4bfecccc5db",
    "Name": "Circle of the Sea",
    "ParentClass": "Druid",
    "Source": "Player\u0027s Handbook",
    "Description": "Become One with Tides and Storms\n\nDruids of the Circle of the Sea draw on the tempestuous forces of oceans and storms. Some view themselves as embodiments of nature’s wrath, seeking vengeance against those who despoil nature. Others seek mystical unity with nature by attuning themselves to the ebb and flow of the tides, following the rush of currents and waves and listening to the inscrutable whispers and roars of the winds.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nBecome One with Tides and Storms\nDruids of the Circle of the Sea draw on the tempestuous forces of oceans and storms. Some view themselves as embodiments of nature’s wrath, seeking vengeance against those who despoil nature. Others seek mystical unity with nature by attuning themselves to the ebb and flow of the tides, following the rush of currents and waves and listening to the inscrutable whispers and roars of the winds.\nLevel 3: Circle of the Sea Spells\nWhen you reach a Druid level specified in the Circle of the Sea Spells table, you thereafter always have the listed spells prepared.\nCircle of the Sea Spells\n\n\nDruid Level\nPrepared Spells\n\n\n3\nFog Cloud, Gust of Wind, Ray of Frost, Thunderwave\n\n\n5\nLightning Bolt, Water Breathing\n\n\n7\nControl Water, Ice Storm\n\n\n9\nConjure Elemental, Hold Monster\n\n\nLevel 3: Wrath of the Sea\nAs a Bonus Action, you can expend a use of your Wild Shape to manifest a 5-foot Emanation that takes the form of ocean spray that surrounds you for 10 minutes. It ends early if you dismiss it (no action required), manifest it again, or have the Incapacitated condition.\nWhen you manifest the Emanation and as a Bonus Action on your subsequent turns, you can choose another creature you can see in the Emanation. The target must succeed on a Constitution saving throw against your spell save DC or take Cold damage and, if the creature is Large or smaller, be pushed up to 15 feet away from you. To determine this damage, roll a number of d6s equal to your Wisdom modifier (minimum of one die).\nLevel 6: Aquatic Affinity\nThe size of the Emanation created by your Wrath of the Sea increases to 10 feet.\nIn addition, you gain a Swim Speed equal to your Speed.\nLevel 10: Stormborn\nYour Wrath of the Sea confers two more benefits while active, as detailed below.\nFlight. You gain a Fly Speed equal to your Speed.\nResistance. You have Resistance to Cold, Lightning, and Thunder damage.\nLevel 14: Oceanic Gift\nInstead of manifesting the Emanation of Wrath of the Sea around yourself, you can manifest it around one willing creature within 60 feet of yourself. That creature gains all the benefits of the Emanation and uses your spell save DC and Wisdom modifier for it.\nIn addition, you can manifest the Emanation around both the other creature and yourself if you expend two uses of your Wild Shape instead of one when manifesting it.\n"
  },
  {
    "Id": "804b7732-1e91-4329-98ed-209a00892681",
    "Name": "Circle of the Stars",
    "ParentClass": "Druid",
    "Source": "Player\u0027s Handbook",
    "Description": "Harness Secrets Hidden in Constellations\n\nThe Circle of the Stars has tracked heavenly patterns since time immemorial, discovering secrets hidden amid the constellations. By understanding these secrets, the Druids of this circle seek to harness the powers of the cosmos.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nHarness Secrets Hidden in Constellations\nThe Circle of the Stars has tracked heavenly patterns since time immemorial, discovering secrets hidden amid the constellations. By understanding these secrets, the Druids of this circle seek to harness the powers of the cosmos.\nLevel 3: Star Map\nYou’ve created a star chart as part of your heavenly studies. It is a Tiny object, and you can use it as a Spellcasting Focus for your Druid spells. You determine its form by rolling on the Star Map table or by choosing one.\nWhile holding the map, you have the Guidance and Guiding Bolt spells prepared, and you can cast Guiding Bolt without expending a spell slot. You can cast it in that way a number of times equal to your Wisdom modifier (minimum of once), and you regain all expended uses when you finish a Long Rest.\nIf you lose the map, you can perform a 1-hour ceremony to magically create a replacement. This ceremony can be performed during a Short or Long Rest, and it destroys the previous map.\nStar Map\n\n\n1d6\nMap Form\n\n\n1\nA scroll bearing depictions of constellations\n\n\n2\nA stone tablet with fine holes drilled through it\n\n\n3\nAn owlbear hide tooled with stellar symbols\n\n\n4\nA collection of maps bound in an ebony cover\n\n\n5\nA crystal engraved with starry patterns\n\n\n6\nA glass disk etched with constellations\n\n\nLevel 3: Starry Form\nAs a Bonus Action, you can expend a use of your Wild Shape feature to take on a starry form rather than shape-shifting.\nWhile in your starry form, you retain your game statistics, but your body becomes luminous, your joints glimmer like stars, and glowing lines connect them as on a star chart. This form sheds Bright Light in a 10-foot radius and Dim Light for an additional 10 feet. The form lasts for 10 minutes. It ends early if you dismiss it (no action required), have the Incapacitated condition, or use this feature again.\nWhenever you assume your starry form, choose which of the following constellations glimmers on your body; your choice gives you certain benefits while in the form.\nArcher. A constellation of an archer appears on you. When you activate this form and as a Bonus Action on your subsequent turns while it lasts, you can make a ranged spell attack, hurling a luminous arrow that targets one creature within 60 feet of yourself. On a hit, the attack deals Radiant damage equal to 1d8 plus your Wisdom modifier.\nChalice. A constellation of a life-giving goblet appears on you. Whenever you cast a spell using a spell slot that restores Hit Points to a creature, you or another creature within 30 feet of you can regain Hit Points equal to 1d8 plus your Wisdom modifier.\nDragon. A constellation of a wise dragon appears on you. When you make an Intelligence or a Wisdom check or a Constitution saving throw to maintain Concentration, you can treat a roll of 9 or lower on the d20 as a 10.\nLevel 6: Cosmic Omen\nWhenever you finish a Long Rest, you can consult your Star Map for omens and roll a die. Until you finish your next Long Rest, you gain access to a special Reaction based on whether you rolled an even or an odd number on the die:\nWeal (Even). Whenever a creature you can see within 30 feet of you is about to make a D20 Test, you can take a Reaction to roll 1d6 and add the number rolled to the total.\nWoe (Odd). Whenever a creature you can see within 30 feet of you is about to make a D20 Test, you can take a Reaction to roll 1d6 and subtract the number rolled from the total.\nYou can use this Reaction a number of times equal to your Wisdom modifier (minimum of once), and you regain all expended uses when you finish a Long Rest.\nLevel 10: Twinkling Constellations\nThe constellations of your Starry Form improve. The 1d8 of the Archer and the Chalice becomes 2d8, and while the Dragon is active, you have a Fly Speed of 20 feet and can hover.\nMoreover, at the start of each of your turns while in your Starry Form, you can change which constellation glimmers on your body.\nLevel 14: Full of Stars\nWhile in your Starry Form, you become partially incorporeal, giving you Resistance to Bludgeoning, Piercing, and Slashing damage.\n"
  },
  {
    "Id": "2e2ecce3-518a-4ef0-a690-8be75c546ba3",
    "Name": "Battle Master",
    "ParentClass": "Fighter",
    "Source": "Player\u0027s Handbook",
    "Description": "Master Sophisticated Battle Maneuvers\n\nBattle Masters are students of the art of battle, learning martial techniques passed down through generations. The most accomplished Battle Masters are well-rounded figures who combine their carefully honed combat skills with academic study in the fields of history, theory, and the arts.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nMaster Sophisticated Battle Maneuvers\nBattle Masters are students of the art of battle, learning martial techniques passed down through generations. The most accomplished Battle Masters are well-rounded figures who combine their carefully honed combat skills with academic study in the fields of history, theory, and the arts.\nLevel 3: Combat Superiority\nYour experience on the battlefield has refined your fighting techniques. You learn maneuvers that are fueled by special dice called Superiority Dice.\nManeuvers. You learn three maneuvers of your choice from the “Maneuver Options” section later in this subclass’s description. Many maneuvers enhance an attack in some way. You can use only one maneuver per attack.\nYou learn two additional maneuvers of your choice when you reach Fighter levels 7, 10, and 15. Each time you learn new maneuvers, you can also replace one maneuver you know with a different one.\nSuperiority Dice. You have four Superiority Dice, which are d8s. A Superiority Die is expended when you use it. You regain all expended Superiority Dice when you finish a Short or Long Rest.\nYou gain an additional Superiority Die when you reach Fighter levels 7 (five dice total) and 15 (six dice total).\nSaving Throws. If a maneuver requires a saving throw, the DC equals 8 plus your Strength or Dexterity modifier (your choice) and Proficiency Bonus.\nLevel 3: Student of War\nYou gain proficiency with one type of Artisan’s Tools of your choice, and you gain proficiency in one skill of your choice from the skills available to Fighters at level 1.\nLevel 7: Know Your Enemy\nAs a Bonus Action, you can discern certain strengths and weaknesses of a creature you can see within 30 feet of yourself; you know whether that creature has any Immunities, Resistances, or Vulnerabilities, and if the creature has any, you know what they are.\nOnce you use this feature, you can’t do so again until you finish a Long Rest. You can also restore a use of the feature by expending one Superiority Die (no action required).\nLevel 10: Improved Combat Superiority\nYour Superiority Die becomes a d10.\nLevel 15: Relentless\nOnce per turn, when you use a maneuver, you can roll 1d8 and use the number rolled instead of expending a Superiority Die.\nLevel 18: Ultimate Combat Superiority\nYour Superiority Die becomes a d12.\nManeuver Options\nThe maneuvers are presented here in alphabetical order.\nAmbush.\nWhen you make a Dexterity (Stealth) check or an Initiative roll, you can expend one Superiority Die and add the die to the roll, unless you have the Incapacitated condition.\nBait and Switch.\nWhen you’re within 5 feet of a creature on your turn, you can expend one Superiority Die and switch places with that creature, provided you spend at least 5 feet of movement and the creature is willing and doesn’t have the Incapacitated condition. This movement doesn’t provoke Opportunity Attacks.\nRoll the Superiority Die. Until the start of your next turn, you or the other creature (your choice) gains a bonus to AC equal to the number rolled.\nCommander’s Strike.\nWhen you take the Attack action on your turn, you can replace one of your attacks to direct one of your companions to strike. When you do so, choose a willing creature who can see or hear you and expend one Superiority Die. That creature can immediately use its Reaction to make one attack with a weapon or an Unarmed Strike, adding the Superiority Die to the attack’s damage roll on a hit.\nCommanding Presence.\nWhen you make a Charisma (Intimidation, Performance, or Persuasion) check, you can expend one Superiority Die and add that die to the roll.\nDisarming Attack.\nWhen you hit a creature with an attack roll, you can expend one Superiority Die to attempt to disarm the target. Add the Superiority Die roll to the attack’s damage roll. The target must succeed on a Strength saving throw or drop one object of your choice that it’s holding, with the object landing in its space.\nDistracting Strike.\nWhen you hit a creature with an attack roll, you can expend one Superiority Die to distract the target. Add the Superiority Die roll to the attack’s damage roll. The next attack roll against the target by an attacker other than you has Advantage if the attack is made before the start of your next turn.\nEvasive Footwork.\nAs a Bonus Action, you can expend one Superiority Die and take the Disengage action. You also roll the die and add the number rolled to your AC until the start of your next turn.\nFeinting Attack.\nAs a Bonus Action, you can expend one Superiority Die to feint, choosing one creature within 5 feet of yourself as your target. You have Advantage on your next attack roll against that target this turn. If that attack hits, add the Superiority Die to the attack’s damage roll.\nGoading Attack.\nWhen you hit a creature with an attack roll, you can expend one Superiority Die to attempt to goad the target into attacking you. Add the Superiority Die to the attack’s damage roll. The target must succeed on a Wisdom saving throw or have Disadvantage on attack rolls against targets other than you until the end of your next turn.\nLunging Attack.\nAs a Bonus Action, you can expend one Superiority Die and take the Dash action. If you move at least 5 feet in a straight line immediately before hitting with a melee attack as part of the Attack action on this turn, you can add the Superiority Die to the attack’s damage roll.\nManeuvering Attack.\nWhen you hit a creature with an attack roll, you can expend one Superiority Die to maneuver one of your comrades into another position. Add the Superiority Die roll to the attack’s damage roll, and choose a willing creature who can see or hear you. That creature can use its Reaction to move up to half its Speed without provoking an Opportunity Attacks from the target of your attack.\nMenacing Attack.\nWhen you hit a creature with an attack roll, you can expend one Superiority Die to attempt to frighten the target. Add the Superiority Die to the attack’s damage roll. The target must succeed on a Wisdom saving throw or have the Frightened condition until the end of your next turn.\nParry.\nWhen another creature damages you with a melee attack roll, you can take a Reaction and expend one Superiority Die to reduce the damage by the number you roll on your Superiority Die plus your Strength or Dexterity modifier (your choice).\nPrecision Attack.\nWhen you miss with an attack roll, you can expend one Superiority Die, roll that die, and add it to the attack roll, potentially causing the attack to hit.\nPushing Attack.\nWhen you hit a creature with an attack roll using a weapon or an Unarmed Strike, you can expend one Superiority Die to attempt to drive the target back. Add the Superiority Die to the attack’s damage roll. If the target is Large or smaller, it must succeed on a Strength saving throw or be pushed up to 15 feet directly away from you.\nRally.\nAs a Bonus Action, you can expend one Superiority Die to bolster the resolve of a companion. Choose an ally of yours within 30 feet of yourself who can see or hear you. That creature gains Temporary Hit Points equal to the Superiority Die roll plus half your Fighter level (round down).\nRiposte.\nWhen a creature misses you with a melee attack roll, you can take a Reaction and expend one Superiority Die to make a melee attack roll with a weapon or an Unarmed Strike against the creature. If you hit, add the Superiority Die to the attack’s damage.\nSweeping Attack.\nWhen you hit a creature with a melee attack roll using a weapon or an Unarmed Strike, you can expend one Superiority Die to attempt to damage another creature. Choose another creature within 5 feet of the original target and within your reach. If the original attack roll would hit the second creature, it takes damage equal to the number you roll on your Superiority Die. The damage is of the same type dealt by the original attack.\nTactical Assessment.\nWhen you make an Intelligence (History or Investigation) check or a Wisdom (Insight) check, you can expend one Superiority Die and add that die to the ability check.\nTrip Attack.\nWhen you hit a creature with an attack roll using a weapon or an Unarmed Strike, you can expend one Superiority Die and add the die to the attack’s damage roll. If the target is Large or smaller, it must succeed on a Strength saving throw or have the Prone condition.\n"
  },
  {
    "Id": "f228b012-7529-475d-a3b9-eec5086d4484",
    "Name": "Champion",
    "ParentClass": "Fighter",
    "Source": "Player\u0027s Handbook",
    "Description": "Pursue Physical Excellence in Combat\n\nA Champion focuses on the development of martial prowess in a relentless pursuit of victory. Champions combine rigorous training with physical excellence to deal devastating blows, withstand peril, and garner glory. Whether in athletic contests or bloody battle, Champions strive for the crown of the victor.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nPursue Physical Excellence in Combat\nA Champion focuses on the development of martial prowess in a relentless pursuit of victory. Champions combine rigorous training with physical excellence to deal devastating blows, withstand peril, and garner glory. Whether in athletic contests or bloody battle, Champions strive for the crown of the victor.\nLevel 3: Improved Critical\nYour attack rolls with weapons and Unarmed Strikes can score a Critical Hit on a roll of 19 or 20 on the d20.\nLevel 3: Remarkable Athlete\nThanks to your athleticism, you have Advantage on Initiative rolls and Strength (Athletics) checks.\nIn addition, immediately after you score a Critical Hit, you can move up to half your Speed without provoking Opportunity Attacks.\nLevel 7: Additional Fighting Style\nYou gain another Fighting Style feat of your choice.\nLevel 10: Heroic Warrior\nThe thrill of battle drives you toward victory. During combat, you can give yourself Heroic Inspiration whenever you start your turn without it.\nLevel 15: Superior Critical\nYour attack rolls with weapons and Unarmed Strikes can now score a Critical Hit on a roll of 18-20 on the d20.\nLevel 18: Survivor\nYou attain the pinnacle of resilience in battle, giving you these benefits.\nDefy Death. You have Advantage on Death Saving Throws. Moreover, when you roll 18-20 on a Death Saving Throw, you gain the benefit of rolling a 20 on it.\nHeroic Rally. At the start of each of your turns, you regain Hit Points equal to 5 plus your Constitution modifier if you are Bloodied and have at least 1 Hit Point.\n"
  },
  {
    "Id": "cedcce46-b6f9-4f58-8da4-44b552ef1470",
    "Name": "Eldritch Knight",
    "ParentClass": "Fighter",
    "Source": "Player\u0027s Handbook",
    "Description": "Support Combat Skills with Arcane Magic\n\nEldritch Knights combine the martial mastery common to all Fighters with a careful study of magic. Their spells both complement and extend their combat skills, providing additional protection to shore up their armor and also allowing them to engage many foes at once with explosive magic.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nSupport Combat Skills with Arcane Magic\nEldritch Knights combine the martial mastery common to all Fighters with a careful study of magic. Their spells both complement and extend their combat skills, providing additional protection to shore up their armor and also allowing them to engage many foes at once with explosive magic.\nLevel 3: Spellcasting\nYou have learned to cast spells. See chapter 7 for the rules on spellcasting. The information below details how you use those rules as an Eldritch Knight.\nCantrips. You know two cantrips of your choice from the Wizard spell list (see that class’s section for its list). Ray of Frost and Shocking Grasp are recommended. Whenever you gain a Fighter level, you can replace one of these cantrips with another cantrip of your choice from the Wizard spell list.\nWhen you reach Fighter level 10, you learn another Wizard cantrip of your choice.\nSpell Slots. The Eldritch Knight Spellcasting table shows how many spell slots you have to cast your level 1\u002B spells. You regain all expended slots when you finish a Long Rest.\nPrepared Spells of Level 1\u002B. You prepare the list of level 1\u002B spells that are available for you to cast with this feature. To start, choose three level 1 spells from the Wizard spell list. Burning Hands, Jump, and Shield are recommended.\nThe number of spells on your list increases as you gain Fighter levels, as shown in the Prepared Spells column of the Eldritch Knight Spellcasting table. Whenever that number increases, choose additional spells from the Wizard spell list until the number of spells on your list matches the number on the table. The chosen spells must be of a level for which you have spell slots. For example, if you’re a level 7 Fighter, your list of prepared spells can include five Wizard spells of levels 1 and 2 in any combination.\nChanging Your Prepared Spells. Whenever you gain a Fighter level, you can replace one spell on your list with another Wizard spell for which you have spell slots.\nSpellcasting Ability. Intelligence is your spellcasting ability for your Wizard spells.\nSpellcasting Focus. You can use an Arcane Focus as a Spellcasting Focus for your Wizard spells.\nEldritch Knight Spellcasting\n\n\nFighter Level\nPrepared Spells\n1st\n2nd\n3rd\n4th\n\n\n3\n3\n2\n-\n-\n-\n\n\n4\n4\n3\n-\n-\n-\n\n\n5\n4\n3\n-\n-\n-\n\n\n6\n4\n3\n-\n-\n-\n\n\n7\n5\n4\n2\n-\n-\n\n\n8\n6\n4\n2\n-\n-\n\n\n9\n6\n4\n2\n-\n-\n\n\n10\n7\n4\n3\n-\n-\n\n\n11\n8\n4\n3\n-\n-\n\n\n12\n8\n4\n3\n-\n-\n\n\n13\n9\n4\n3\n2\n-\n\n\n14\n10\n4\n3\n2\n-\n\n\n15\n10\n4\n3\n2\n-\n\n\n16\n11\n4\n3\n3\n-\n\n\n17\n11\n4\n3\n3\n-\n\n\n18\n11\n4\n3\n3\n-\n\n\n19\n12\n4\n3\n3\n1\n\n\n20\n13\n4\n3\n3\n1\n\n\nLevel 3: War Bond\nYou learn a ritual that creates a magical bond between yourself and one weapon. You perform the ritual over the course of 1 hour, which can be done during a Short Rest. The weapon must be within your reach throughout the ritual, at the conclusion of which you touch the weapon and forge the bond. The bond fails if another Fighter is bonded to the weapon or if the weapon is a magic item to which someone else is attuned.\nOnce you have bonded a weapon to yourself, you can’t be disarmed of that weapon unless you have the Incapacitated condition. If it is on the same plane of existence, you can summon that weapon as a Bonus Action, causing it to teleport instantly to your hand.\nYou can have up to two bonded weapons, but you can summon only one at a time with a Bonus Action. If you attempt to bond with a third weapon, you must break the bond with one of the other two.\nLevel 7: War Magic\nWhen you take the Attack action on your turn, you can replace one of the attacks with a casting of one of your Wizard cantrips that has a casting time of an action.\nLevel 10: Eldritch Strike\nYou learn how to make your weapon strikes undercut a creature’s ability to withstand your spells. When you hit a creature with an attack using a weapon, that creature has Disadvantage on the next saving throw it makes against a spell you cast before the end of your next turn.\nLevel 15: Arcane Charge\nWhen you use your Action Surge, you can teleport up to 30 feet to an unoccupied space you can see. You can teleport before or after the additional action.\nLevel 18: Improved War Magic\nWhen you take the Attack action on your turn, you can replace two of the attacks with a casting of one of your level 1 or level 2 Wizard spells that has a casting time of an action.\n"
  },
  {
    "Id": "6e0669e9-b993-48a4-a9d0-2ed085603f13",
    "Name": "Psi Warrior",
    "ParentClass": "Fighter",
    "Source": "Player\u0027s Handbook",
    "Description": "Augment Physical Might with Psionic Power\n\nPsi Warriors awaken the power of their minds to augment their physical might. They harness this psionic power to infuse their weapon strikes, lash out with telekinetic energy, and create barriers of mental force.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nAugment Physical Might with Psionic Power\nPsi Warriors awaken the power of their minds to augment their physical might. They harness this psionic power to infuse their weapon strikes, lash out with telekinetic energy, and create barriers of mental force.\nLevel 3: Psionic Power\nYou harbor a wellspring of psionic energy within yourself. It is represented by your Psionic Energy Dice, which fuel powers you have from this subclass. The Psi Warrior Energy Dice table shows the die size and number of these dice you have when you reach certain Fighter levels.\nPsi Warrior Energy Dice\n\n\nFighter Level\nDie Size\nNumber\n\n\n3\nD6\n4\n\n\n5\nD8\n6\n\n\n9\nD8\n8\n\n\n11\nD10\n8\n\n\n13\nD10\n10\n\n\n17\nD12\n12\n\n\nAny features in this subclass that use a Psionic Energy Die use only the dice from this subclass. Some of your powers expend the Psionic Energy Die, as specified in a power’s description, and you can’t use a power if it requires you to use a die when all your Psionic Energy Dice are expended.\nYou regain one of your expended Psionic Energy Dice when you finish a Short Rest, and you regain all of them when you finish a Long Rest.\nProtective Field. When you or another creature you can see within 30 feet of you takes damage, you can take a Reaction to expend one Psionic Energy Die, roll the die, and reduce the damage taken by the number rolled plus your Intelligence modifier (minimum reduction of 1), as you create a momentary shield of telekinetic force.\nPsionic Strike. You can propel your weapons with psionic force. Once on each of your turns, immediately after you hit a target within 30 feet of yourself with an attack and deal damage to it with a weapon, you can expend one Psionic Energy Die, rolling it and dealing Force damage to the target equal to the number rolled plus your Intelligence modifier.\nTelekinetic Movement. You can move an object or a creature with your mind. As a Magic action, choose one target you can see within 30 feet of yourself; the target must be a loose object that is Large or smaller or one willing creature other than you. You transport the target up to 30 feet to an unoccupied space you can see. Alternatively, if the target is a Tiny object, you can transport it to or from your hand.\nOnce you take this action, you can’t do so again until you finish a Short or Long Rest unless you expend a Psionic Energy Die (no action required) to restore your use of it.\nLevel 7: Telekinetic Adept\nYou have mastered new ways to use your telekinetic abilities, detailed below.\nPsi-Powered Leap. As a Bonus Action, you gain a Fly Speed equal to twice your Speed until the end of the current turn. Once you take this Bonus Action, you can’t do so again until you finish a Short or Long Rest unless you expend a Psionic Energy Die (no action required) to restore your use of it.\nTelekinetic Thrust. When you deal damage to a target with your Psionic Strike, you can force the target to make a Strength saving throw (DC 8 plus your Intelligence modifier and Proficiency Bonus). On a failed save, you can give the target the Prone condition or transport it up to 10 feet horizontally.\nLevel 10: Guarded Mind\nYou have Resistance to Psychic damage. Moreover, if you start your turn with the Charmed or Frightened condition, you can expend a Psionic Energy Die (no action required) and end every effect on yourself giving you those conditions.\nLevel 15: Bulwark of Force\nYou can shield yourself and others with telekinetic force. As a Bonus Action, you can choose creatures, including yourself, within 30 feet of yourself, up to a number of creatures equal to your Intelligence modifier (minimum of one creature). Each of the chosen creatures has Half Cover for 1 minute or until you have the Incapacitated condition.\nOnce you use this feature, you can’t do so again until you finish a Long Rest unless you expend a Psionic Energy Die (no action required) to restore your use of it.\nLevel 18: Telekinetic Master\nYou always have the telekinesis spell prepared. With this feature, you can cast it without a spell slot or components, and your spellcasting ability for it is Intelligence. On each of your turns while you maintain Concentration on it, including the turn when you cast it, you can make one attack with a weapon as a Bonus Action.\nOnce you cast the spell with this feature, you can’t do so in this way again until you finish a Long Rest unless you expend a Psionic Energy Die (no action required) to restore your use of it.\n"
  },
  {
    "Id": "ae77f1d0-9cfa-4edf-9d3e-fa1b07746468",
    "Name": "Warrior of Mercy",
    "ParentClass": "Monk",
    "Source": "Player\u0027s Handbook",
    "Description": "Manipulate Forces of Life and Death\n\nWarriors of Mercy manipulate the life force of others. These Monks are wandering physicians, but they bring a swift end to their enemies. They often wear masks, presenting themselves as faceless bringers of life and death.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nManipulate Forces of Life and Death\nWarriors of Mercy manipulate the life force of others. These Monks are wandering physicians, but they bring a swift end to their enemies. They often wear masks, presenting themselves as faceless bringers of life and death.\nLevel 3: Hand of Harm\nOnce per turn when you hit a creature with an Unarmed Strike and deal damage, you can expend 1 Focus Point to deal extra Necrotic damage equal to one roll of your Martial Arts die plus your Wisdom modifier.\nLevel 3: Hand of Healing\nAs a Magic action, you can expend 1 Focus Point to touch a creature and restore a number of Hit Points equal to a roll of your Martial Arts die plus your Wisdom modifier.\nWhen you use your Flurry of Blows, you can replace one of the Unarmed Strikes with a use of this feature without expending a Focus Point for the healing.\nLevel 3: Implements of Mercy\nYou gain proficiency in the Insight and Medicine skills and proficiency with the Herbalism Kit.\nLevel 6: Physician’s Touch\nYour Hand of Harm and Hand of Healing improve, as detailed below.\nHand of Harm. When you use Hand of Harm on a creature, you can also give that creature the Poisoned condition until the end of your next turn.\nHand of Healing. When you use Hand of Healing, you can also end one of the following conditions on the creature you heal: Blinded, Deafened, Paralyzed, Poisoned, or Stunned.\nLevel 11: Flurry of Healing and Harm\nWhen you use Flurry of Blows, you can replace each of the Unarmed Strikes with a use of Hand of Healing without expending Focus Points for the healing.\nIn addition, when you make an Unarmed Strike with Flurry of Blows and deal damage, you can use Hand of Harm with that strike without expending a Focus Point for Hand of Harm. You can still use Hand of Harm only once per turn.\nYou can use these benefits a total number of times equal to your Wisdom modifier (minimum of once). You regain all expended uses when you finish a Long Rest.\nLevel 17: Hand of Ultimate Mercy\nYour mastery of life energy opens the door to the ultimate mercy. As a Magic action, you can touch the corpse of a creature that died within the past 24 hours and expend 5 Focus Points. The creature then returns to life with a number of Hit Points equal to 4d10 plus your Wisdom modifier. If the creature died with any of the following conditions, the creature revives with the conditions removed: Blinded, Deafened, Paralyzed, Poisoned, and Stunned.\nOnce you use this feature, you can’t use it again until you finish a Long Rest.\n"
  },
  {
    "Id": "e307ce98-30e2-437a-b879-2f5fe80e95ba",
    "Name": "Warrior of Shadow",
    "ParentClass": "Monk",
    "Source": "Player\u0027s Handbook",
    "Description": "Harness Shadow Power for Stealth and Subterfuge\n\nWarriors of Shadow practice stealth and subterfuge, harnessing the power of the Shadowfell. They are at home in darkness, able to draw gloom around themselves to hide, leap from shadow to shadow, and take on a wraithlike form.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nHarness Shadow Power for Stealth and Subterfuge\nWarriors of Shadow practice stealth and subterfuge, harnessing the power of the Shadowfell. They are at home in darkness, able to draw gloom around themselves to hide, leap from shadow to shadow, and take on a wraithlike form.\nLevel 3: Shadow Arts\nYou have learned to draw on the power of the Shadowfell, gaining the following benefits.\nDarkness. You can expend 1 Focus Point to cast the Darkness spell without spell components. You can see within the spell’s area when you cast it with this feature. While the spell persists, you can move its area of Darkness to a space within 60 feet of yourself at the start of each of your turns.\nDarkvision. You gain Darkvision with a range of 60 feet. If you already have Darkvision, its range increases by 60 feet.\nShadowy Figments. You know the Minor Illusion spell. Wisdom is your spellcasting ability for it.\nLevel 6: Shadow Step\nWhile entirely within Dim Light or Darkness, you can use a Bonus Action to teleport up to 60 feet to an unoccupied space you can see that is also in Dim Light or Darkness. You then have Advantage on the next melee attack you make before the end of the current turn.\nLevel 11: Improved Shadow Step\nYou can draw on your Shadowfell connection to empower your teleportation. When you use your Shadow Step, you can expend 1 Focus Point to remove the requirement that you must start and end in Dim Light or Darkness for that use of the feature. As part of this Bonus Action, you can make an Unarmed Strike immediately after you teleport.\nLevel 17: Cloak of Shadows\nAs a Magic action while entirely within Dim Light or Darkness, you can expend 3 Focus Points to shroud yourself with shadows for 1 minute, until you have the Incapacitated condition, or until you end your turn in Bright Light. While shrouded by these shadows, you gain the following benefits.\nInvisibility. You have the Invisible condition.\nPartially Incorporeal. You can move through occupied spaces as if they were Difficult Terrain. If you end your turn in such a space, you are shunted to the last unoccupied space you were in.\nShadow Flurry. You can use your Flurry of Blows without expending any Focus Points.\n"
  },
  {
    "Id": "fc2bcdb5-cfbf-49ae-8fdf-a62701696892",
    "Name": "Warrior of the Elements",
    "ParentClass": "Monk",
    "Source": "Player\u0027s Handbook",
    "Description": "Wield Strikes and Bursts of Elemental Power\n\nWarriors of the Elements tap into the power of the Elemental Planes. Harnessing their supernatural focus, these Monks momentarily tame the energy of the Elemental Chaos to empower themselves in and out of battle.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nWield Strikes and Bursts of Elemental Power\nWarriors of the Elements tap into the power of the Elemental Planes. Harnessing their supernatural focus, these Monks momentarily tame the energy of the Elemental Chaos to empower themselves in and out of battle.\nLevel 3: Elemental Attunement\nAt the start of your turn, you can expend 1 Focus Point to imbue yourself with elemental energy. The energy lasts for 10 minutes or until you have the Incapacitated condition. You gain the following benefits while this feature is active.\nReach. When you make an Unarmed Strike, your reach is 10 feet greater than normal, as elemental energy extends from you.\nElemental Strikes. Whenever you hit with your Unarmed Strike, you can cause it to deal your choice of Acid, Cold, Fire, Lightning, or Thunder damage rather than its normal damage type. When you deal one of these types with it, you can also force the target to make a Strength saving throw. On a failed save, you can move the target up to 10 feet toward or away from you, as elemental energy swirls around it.\nLevel 3: Manipulate Elements\nYou know the Elementalism spell. Wisdom is your spellcasting ability for it.\nLevel 6: Elemental Burst\nAs a Magic action, you can expend 2 Focus Points to cause elemental energy to burst in a 20-foot-radius Sphere centered on a point within 120 feet of yourself. Choose a damage type: Acid, Cold, Fire, Lightning, or Thunder.\nEach creature in the Sphere must make a Dexterity saving throw. On a failed save, a creature takes damage of the chosen type equal to three rolls of your Martial Arts die. On a successful save, a creature takes half as much damage.\nLevel 11: Stride of the Elements\nWhile your Elemental Attunement is active, you also have a Fly Speed and a Swim Speed equal to your Speed.\nLevel 17: Elemental Epitome\nWhile your Elemental Attunement is active, you also gain the following benefits.\nDamage Resistance. You gain Resistance to one of the following damage types of your choice: Acid, Cold, Fire, Lightning, or Thunder. At the start of each of your turns, you can change this choice.\nDestructive Stride. When you use your Step of the Wind, your Speed increases by 20 feet until the end of the turn. For that duration, any creature of your choice takes damage equal to one roll of your Martial Arts die when you enter a space within 5 feet of it. The damage type is your choice of Acid, Cold, Fire, Lightning, or Thunder. A creature can take this damage only once per turn.\nEmpowered Strikes. Once on each of your turns, you can deal extra damage to a target equal to one roll of your Martial Arts die when you hit it with an Unarmed Strike. The extra damage is the same type dealt by that strike.\n"
  },
  {
    "Id": "86da2ab9-7bad-48c5-9dfa-acef1e1d37f4",
    "Name": "Warrior of the Open Hand",
    "ParentClass": "Monk",
    "Source": "Player\u0027s Handbook",
    "Description": "Master Unarmed Combat Techniques\n\nWarriors of the Open Hand are masters of unarmed combat. They learn techniques to push and trip their opponents and manipulate their own energy to protect themselves from harm.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nMaster Unarmed Combat Techniques\nWarriors of the Open Hand are masters of unarmed combat. They learn techniques to push and trip their opponents and manipulate their own energy to protect themselves from harm.\nLevel 3: Open Hand Technique\nWhenever you hit a creature with an attack granted by your Flurry of Blows, you can impose one of the following effects on that target.\nAddle. The target can’t make Opportunity Attacks until the start of its next turn.\nPush. The target must succeed on a Strength saving throw or be pushed up to 15 feet away from you.\nTopple. The target must succeed on a Dexterity saving throw or have the Prone condition.\nLevel 6: Wholeness of Body\nYou gain the ability to heal yourself. As a Bonus Action, you can roll your Martial Arts die. You regain a number of Hit Points equal to the number rolled plus your Wisdom modifier (minimum of 1 Hit Point regained).\nYou can use this feature a number of times equal to your Wisdom modifier (minimum of once), and you regain all expended uses when you finish a Long Rest.\nLevel 11: Fleet Step\nWhen you take a Bonus Action other than Step of the Wind, you can also use Step of the Wind immediately after that Bonus Action.\nLevel 17: Quivering Palm\nYou gain the ability to set up lethal vibrations in someone’s body. When you hit a creature with an Unarmed Strike, you can expend 4 Focus Points to start these imperceptible vibrations, which last for a number of days equal to your Monk level. The vibrations are harmless unless you take an action to end them. Alternatively, when you take the Attack action on your turn, you can forgo one of the attacks to end the vibrations. To end them, you and the target must be on the same plane of existence. When you end them, the target must make a Constitution saving throw, taking 10d12 Force damage on a failed save or half as much damage on a successful one.\nYou can have only one creature under the effect of this feature at a time. You can end the vibrations harmlessly (no action required).\n"
  },
  {
    "Id": "86bc9cbd-118b-40c3-96b3-20a717a2d5bd",
    "Name": "Oath of Devotion",
    "ParentClass": "Paladin",
    "Source": "Player\u0027s Handbook",
    "Description": "Uphold the Ideals of Justice and Order\n\nThe Oath of Devotion binds Paladins to the ideals of Justice and Order. These Paladins meet the archetype of the knight in shining armor. They hold themselves to the highest standards of conduct, and some - for better or worse - hold the rest of the world to the same standards.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nUphold the Ideals of Justice and Order\nThe Oath of Devotion binds Paladins to the ideals of Justice and Order. These Paladins meet the archetype of the knight in shining armor. They hold themselves to the highest standards of conduct, and some - for better or worse - hold the rest of the world to the same standards.\nMany who swear this oath are devoted to gods of law and good and use their gods\u0027 tenets as the measure of personal devotion. Others holed angels as their ideals and incorporate images of angelic wings into their helmets or coats of arms.\nThese Paladins share the following tenets:\n\nLet your word be your promise.\nProtect the weak and never fear to act.\nLet your honorable deeds be an example.\n\nLevel 3: Oath of Devotion Spells\nThe magic of your oath ensures you always have certain spells ready; when you reach a Paladin level specified in the Oath of Devotion Spells table, you thereafter always have the listed spells prepared.\nOath of Devotion Spells\n\n\nPaladin Level\nSpells\n\n\n3\nProtection from Evil and Good, Shield of Faith\n\n\n5\nAid, Zone of Truth\n\n\n9\nBeacon of Hope, Dispel Magic\n\n\n13\nFreedom of Movement, Guardian of Faith\n\n\n17\nCommune, Flame Strike\n\n\nLevel 3: Sacred Weapon\nWhen you take the Attack action, you can expend one use of your Channel Divinity to imbue one Melee weapon that you are holding with positive energy. For 10 minutes or until you use this feature again, you add your Charisma modifier to attack rolls you make with that weapon (minimum bonus of \u002B1), and each time you hit with it, you cause it to deal its normal damage type or Radiant Damage.\nThe weapon also emits Bright Light in a 20-foot radius and Dim Light 20 feet beyond that.\nYou can end this effect early (no action required). This effect also ends if you aren\u0027t carrying the weapon.\nLevel 7: Aura of Devotion\nYou and your allies have Immunity to the Charmed condition while in your Aura of Protection. If a Charmed ally enters the aura, that condition has no effect on that ally while there.\nLevel 15: Smite of Protection\nYour magical smite now radiates protective energy. Whenever you cast Divine Smite, you and your allies have Half Cover while in your Aura of Protection.\nThe aura has this benefit until the start of your next turn.\nLevel 20: Holy Nimbus\nAs a Bonus Action, you can imbue your Aura of Protection with holy power, granting the benefits below for 10 minutes or until you end them (no action required). Once you use this feature, you can\u0027t use it again until you finish a Long Rest. You can also restore your use of it by expending a level 5 spell slot (no action required).\nHoly Ward. You have Advantage on any saving throw you are forced to make by a Fiend or an Undead.\nRadiant Damage. Whenever an enemy starts its turn in the aura, that creature takes Radiant damage equal to your Charisma modifier plus your Proficiency Bonus.\nSunlight. The aura is filled with Bright Light that is sunlight.\n"
  },
  {
    "Id": "1aef6078-8a08-4c20-b308-9af813a2cb00",
    "Name": "Oath of Glory",
    "ParentClass": "Paladin",
    "Source": "Player\u0027s Handbook",
    "Description": "Strive for the Heights of Heroism\n\nPaladins who take the Oath of Glory believe they and their companions are destined to achieve glory through deeds of heroism. They train diligently and encourage their companions, so that they\u0027re all ready when destiny calls.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nStrive for the Heights of Heroism\nPaladins who take the Oath of Glory believe they and their companions are destined to achieve glory through deeds of heroism. They train diligently and encourage their companions, so that they\u0027re all ready when destiny calls.\nThese Paladins share the following tenets:\n\nEndeavor to be known by your deeds.\nFace hardships with courage.\nInspire others to strive for glory.\n\nLevel 3: Inspiring Smite\nImmediately after you cast Divine Smite, you can expend one use of your Channel Divinity and distribute Temporary Hit Points to creatures of your choice within 30 feet of yourself, which can include you. The total number of Temporary Hit Points equals 2d8 plus your Paladin level, divided among the chosen creatures however you like.\nLevel 3: Oath of Glory Spells.\nThe magic of your oath ensures you always have certain spells ready; when you reach a Paladin level specified in the Oath of Glory Spells table, you thereafter always have the listed spells prepared.\nOath of Glory Spells\n\n\nPaladin Level\nSpells\n\n\n3\nGuiding Bolt, Heroism\n\n\n5\nEnhance Ability, Magic Weapon\n\n\n9\nHaste, Protection from Energy\n\n\n13\nCompulsion, Freedom of Movement\n\n\n17\nLegend Lore, Yolande\u0027s Regal Presence\n\n\nLevel 3: Peerless Athlete\nAs a Bonus Action, you can expend one use of your Channel Divinity to augment your athleticism. For 1 hour, you have Advantage on Strength (Athletics) and Dexterity (Acrobatics) checks, and the distance of your Long and High Jumps increases by 10 feet (this extra distance costs movement as normal).\nLevel 7: Aura of Alacrity\nYour Speed increases by 10 feet.\nIn addition, whenever an ally enters your Aura of Protection for the first time on a turn or starts their turn there, the ally\u0027s Speed increases by 10 feet until the end of their next turn.\nLevel 15: Glorious Defense\nYou can turn defense into a sudden strike. When you or another creature you can see within 10 feet of you is hit by an attack roll, you can take a Reaction to grant a bonus to the target\u0027s AC against that attack, potentially causing it to miss. The bonus equals your Charisma modifier (minimum of \u002B1). If the attack misses, you can make one attack with a weapon against the attacker as part of this Reaction if the attacker is within your weapon\u0027s range.\nYou can use this feature a number of times equal to your Charisma modifier (minimum of once), and you regain all expended uses when you finish a Long Rest.\nLevel 20: Living Legend\nYou can empower yourself with the legends - whether true or exaggerated - of your great deeds. As a Bonus Action, you gain the benefits below for 10 minutes. Once you use this feature, you can\u0027t use it again until you finish a Long Rest. You can also restore your use of it by expending a level 5 spell slot (no action required).\nCharismatic. You are blessed with an otherworldly presence and have Advantage on all Charisma checks.\nSaving Throw Reroll. If you fail a saving throw, you can take a Reaction to reroll it. You must use this new roll.\nUnerring Strike. Once on each of your turns when you make an attack roll with a weapon and miss, you can cause that attack to hit instead.\n"
  },
  {
    "Id": "c10c424a-2ebc-4792-82a0-9fd3b5306955",
    "Name": "Oath of the Ancients",
    "ParentClass": "Paladin",
    "Source": "Player\u0027s Handbook",
    "Description": "Preserve Life and Light in the World\n\nThe Oath of the Ancients is as old as the first elves.\nPaladins who swear this oath cherish the light; they love the beautiful and life-giving things of the world more than any principles of honor, courage and justice. They often adorn their armor and clothing with images of growing things - leaves, antlers, or flowers - to reflect their commitment to preserving life and light.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nPreserve Life and Light in the World\nThe Oath of the Ancients is as old as the first elves.\nPaladins who swear this oath cherish the light; they love the beautiful and life-giving things of the world more than any principles of honor, courage and justice. They often adorn their armor and clothing with images of growing things - leaves, antlers, or flowers - to reflect their commitment to preserving life and light.\nThese Paladins share the following tenets:\n\nKindle the light of hope.\nShelter life.\nDelight in art and laughter.\n\nLevel 3: Nature\u0027s Wrath\nAs a Magic action, you can expend one of your uses of Channel Divinity to conjure spectral vines around nearby creatures. Each creature of your choice that you can see within 15 feet of yourself must succeed on a Strength saving throw or have the Restrained condition for 1 minute. A Restrained creature repeats the save at the end of each of its turns, ending the effect on a success.\nLevel 3: Oath of the Ancients Spells\nThe magic of your oath ensures you always have certain spells ready; when you reach a Paladin level specified in the Oath of the Ancients Spells table, you thereafter always have the listed spells prepared.\nOath of the Ancients Spells\n\n\nPaladin Level\nSpells\n\n\n3\nEnsnaring Strike, Speak with Animals\n\n\n5\nMisty Step, Moonbeam\n\n\n9\nPlant Growth, Protection from Energy\n\n\n13\nIce Storm, Stoneskin\n\n\n17\nCommune with Nature, Tree Stride\n\n\nLevel 7: Aura of Warding\nAncient magic lies so heavily upon you that it forms an eldritch ward, blunting energy from beyond the Material Plane; you and your allies have Resistance to Necrotic, Psychic and Radiant damage while in your Aura of Protection.\nLevel 15: Undying Sentinel\nWhen you are reduced to 0 Hit Points and not killed outright, you can drop to 1 Hit Point instead, and regain a number of Hit Points equal to three times your Paladin level. Once you use this feature, you can\u0027t do so again until you finish a Long Rest.\nAdditionally, you can\u0027t be aged magically, and you cease visibly aging.\nLevel 20: Elder Champion\nAs a Bonus Action, you can imbue your Aura of Protection with primal power, granting the benefits below for 1 minute or until you end them (no action required). Once you use this feature, you can\u0027t use it again until you finish a Long Rest. You can also restore your use of it by expending a level 5 spell slot (no action required).\nDiminish Defiance. Enemies in the aura have Disadvantage on saving throws against your spells and Channel Divinity options.\nRegeneration. At the start of each of your turns, you regain 10 Hit Points.\nSwift Spells. Whenever you cast a spell that has a casting time of an action, you can cast it using a Bonus Action instead.\n"
  },
  {
    "Id": "52725471-da5a-43d2-80f1-fb74623ab698",
    "Name": "Oath of Vengeance",
    "ParentClass": "Paladin",
    "Source": "Player\u0027s Handbook",
    "Description": "Punish Evildoers at Any Cost\n\nThe Oath of Vengeance is a solemn commitment to punish those who have committed grievously evil acts. When evil armies slaughter helpless villagers, when a tyrant defies the will of the gods, when a thieves\u0027 guild grows too violent, when a dragon rampages though the countryside - at times like these, Paladins arise and swear the Oath of Vengeance to set right what has gone wrong.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nPunish Evildoers at Any Cost\nThe Oath of Vengeance is a solemn commitment to punish those who have committed grievously evil acts. When evil armies slaughter helpless villagers, when a tyrant defies the will of the gods, when a thieves\u0027 guild grows too violent, when a dragon rampages though the countryside - at times like these, Paladins arise and swear the Oath of Vengeance to set right what has gone wrong.\nThese Paladins share the following tenets:\n\nShow the wicked no mercy.\nFight injustice and its causes.\nAid those harmed by injustice.\n\nLevel 3: Oath of Vengeance Spells\nThe magic of your oath ensures you always have certain spells ready; when you reach a Paladin level specified in the Oath of Vengeance Spells table, you thereafter always have the listed spells prepared.\nOath of Vengeance Spells\n\n\nPaladin Level\nSpells\n\n\n3\nBane, Hunter\u0027s Mark\n\n\n5\nHold Person, Misty Step\n\n\n9\nHaste, Protection from Energy\n\n\n13\nBanishment, Dimension Door\n\n\n17\nHold Monster, Scrying\n\n\nLevel 3: Vow of Enmity\nWhen you take the Attack action, you can expend one use of your Channel Divinity to utter a vow of enmity against a creature you can see within 30 feet of yourself. You have Advantage on attack rolls against the creature for 1 minute or until you use this feature again.\nIf the creature drops to 0 Hit Points before the vow ends, you can transfer the vow to a different creature within 30 feet of yourself (no action required).\nLevel 7: Relentless Avenger\nYour supernatural focus helps you close off a foe\u0027s retreat. When you hit a creature with an Opportunity Attack, you can reduce the creature\u0027s Speed to 0 until the end of the current turn. You can then move up to half your Speed as part of the same Reaction. This movement doesn\u0027t provoke Opportunity Attacks.\nLevel 15: Soul of Vengeance\nImmediately after a creature under the effect of your Vow of Enmity hits or misses with an attack roll, you can take a Reaction to make a melee attack against that creature if it\u0027s within range.\nLevel 20: Avenging Angel\nAs a Bonus Action, you gain the benefits below for 10 minutes or until you end them (no action required). Once you use this feature, you can\u0027t use it again until you finish a Long Rest. You can also restore your use of it by expending a level 5 spell slot (no action required).\nFlight. You sprout spectral wings on your back and have a Fly Speed of 60 feet, and can hover.\nFrightful Aura. Whenever an enemy starts its turn in your Aura of Protection, that creature must succeed on a Wisdom saving throw or have the Frightened condition for 1 minute or until it takes any damage. Attack rolls against the Frightened creature have Advantage.\n"
  },
  {
    "Id": "d145268e-b9ed-4c85-99f6-0834ad8bc9f4",
    "Name": "Beast Master",
    "ParentClass": "Ranger",
    "Source": "Player\u0027s Handbook",
    "Description": "Bond with a Primal Beast\nA Beast Master forms a mystical bond with a special animal, drawing on primal magic and a deep connection to the natural world.\n\nYou magically summon a primal beast, which draws strength from your bond with nature. Choose its stat block: Beast of the Land, Beast of the Sea or Beast of the Sky. You also determine the kind of animal it is, choosing a kind appropriate for the stat block. Whatever beast you choose, it bears primal markings indicating its supernatural origin.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nBond with a Primal Beast\nA Beast Master forms a mystical bond with a special animal, drawing on primal magic and a deep connection to the natural world.\nLevel 3: Primal Companion\nYou magically summon a primal beast, which draws strength from your bond with nature. Choose its stat block: Beast of the Land, Beast of the Sea or Beast of the Sky. You also determine the kind of animal it is, choosing a kind appropriate for the stat block. Whatever beast you choose, it bears primal markings indicating its supernatural origin.\nThe Beast in Combat. In Combat, the beast acts during your turn. It can move and use its Reaction on its own, but the only action it takes is the Dodge action unless you take a Bonus Action to command it to take an action in its stat block or some other action. You can also sacrifice one of your attacks when you take the Attack action to command the beast to take the Beast\u0027s Strike action. If you have the Incapacitated condition, the beast acts on its own and isn\u0027t limited to the dodge action.\nRestoring or Replacing the Beast. If the beast has died within the last hour, you can take a Magic action to touch it and expend a spell slot. The beast returns to life after 1 minute with all its Hit Points restored.\nWhenever you finish a Long Rest, you can summon a different primal beast, which appears in an unoccupied space within 5 feet of you. You choose its stat block and appearance. If you already have a beast from this feature, the old one vanishes when the new one appears.\nBeast of the Land\n\n\nBeast of the Land\n\n\nMedium Beast, Neutral\n\n\nArmor Class: 13 plus your Wisdom modifier\n\n\nHit Points: 5 \u002B five times your ranger level (the beast has a number of hit dice [d8s] equal to your ranger level)\n\n\nSpeed: 40 ft., Climb 40 ft\n\n\nSTR (Mod/Save)\nDEX (Mod/Save)\nCON (Mod/Save)\nINT (Mod/Save)\nWIS (Mod/Save)\nCHA (Mod/Save)\n\n\n14 (\u002B2/\u002B2)\n14 (\u002B2/\u002B2)\n15 (\u002B2/\u002B2)\n8 (−1/-1)\n14 (\u002B2/\u002B2)\n11 (\u002B0/\u002B0)\n\n\nSenses: Darkvision 60 ft., Passive Perception 12\n\n\nLanguages: Understands the languages that you know\n\n\nChallenge Rating: None (XP 0; PB equals your Proficiency Bonus)\n\n\nTraits\n\n\nPrimal Bond. Add your Proficiency Bonus to any ability check or saving throw the beast makes.\n\n\nActions\n\n\nBeast\u0027s Strike. Melee Attack Roll: Bonus equals your spell attack modifier, reach 5 ft. Hit: 1d8 \u002B 2 plus your Wisdom modifier Bludgeoning, Piercing, or Slashing damage (Your choice when you summon the beast). If the beast moved at least 20 feet straight toward the target before the hit, the target takes an extra 1d6 damage of the same type, and the target has the Prone condition if it is a Large or smaller creature.\n\n\nBeast of the Sky\n\n\nBeast of the Sky\n\n\nSmall Beast, Neutral\n\n\nArmor Class: 13 plus your Wisdom modifier\n\n\nHit Points: 4 \u002B four times your ranger level (the beast has a number of hit dice [d6s] equal to your ranger level)\n\n\nSpeed: 10 ft., Fly 60 ft\n\n\nSTR (Mod/Save)\nDEX (Mod/Save)\nCON (Mod/Save)\nINT (Mod/Save)\nWIS (Mod/Save)\nCHA (Mod/Save)\n\n\n6 (-2/-2)\n16 (\u002B3/\u002B3)\n13 (\u002B1/\u002B1)\n8 (−1/-1)\n14 (\u002B2/\u002B2)\n11 (\u002B0/\u002B0)\n\n\nSenses: Darkvision 60 ft., Passive Perception 12\n\n\nLanguages: Understands the languages that you know\n\n\nChallenge Rating: None (XP 0; PB equals your Proficiency Bonus)\n\n\nTraits\n\n\nFlyby. The beast doesn\u0027t provoke Opportunity Attacks when it flies out of an enemy\u0027s reach.\n\n\nPrimal Bond. Add your Proficiency Bonus to any ability check or saving throw the beast makes.\n\n\nActions\n\n\nBeast\u0027s Strike. Melee Attack Roll: Bonus equals your spell attack modifier, reach 5 ft. Hit: 1d4 \u002B 3 plus your Wisdom modifier Slashing damage.\n\n\nBeast of the Sea\n\n\nBeast of the Sea\n\n\nMedium Beast, Neutral\n\n\nArmor Class: 13 plus your Wisdom modifier\n\n\nHit Points: 5 \u002B five times your ranger level (the beast has a number of hit dice [d8s] equal to your ranger level)\n\n\nSpeed: 5 ft., Swim 60 ft\n\n\nSTR (Mod/Save)\nDEX (Mod/Save)\nCON (Mod/Save)\nINT (Mod/Save)\nWIS (Mod/Save)\nCHA (Mod/Save)\n\n\n14 (\u002B2/\u002B2)\n14 (\u002B2/\u002B2)\n15 (\u002B2/\u002B2)\n8 (−1/-1)\n14 (\u002B2/\u002B2)\n11 (\u002B0/\u002B0)\n\n\nSenses: Darkvision 90 ft., Passive Perception 12\n\n\nLanguages: Understands the languages that you know\n\n\nChallenge Rating: None (XP 0; PB equals your Proficiency Bonus)\n\n\nTraits\n\n\nAmphibious. The beast can breathe air and water\n\n\nPrimal Bond. Add your Proficiency Bonus to any ability check or saving throw the beast makes.\n\n\nActions\n\n\nBeast\u0027s Strike. Melee Attack Roll: Bonus equals your spell attack modifier, reach 5 ft. Hit: 1d6 \u002B 2 plus your Wisdom modifier Bludgeoning or Piercing damage (Your choice when you summon the beast), and the target has the Grappled condition (escape DC equals your spell save DC).\n\n\nLevel 7: Exceptional Training\nWhen you take a Bonus Action to command your Primal Companion beast to take an action, you can also command it to take the Dash, Disengage, Dodge, or Help action using its Bonus Action.\nIn addition, whenever it hits with an attack roll and deals damage, it can deal your choice of Force damage or its normal damage type.\nLevel 11: Bestial Fury\nWhen you command your Primal Companion beast to take the Beast\u0027s Strike action, the beast can use it twice.\nIn addition, the first time each turn it hits a creature under the effect of your Hunter\u0027s Mark spell, the beast deals extra Force damage equal to the bonus damage of that spell.\nLevel 15: Share Spells\nWhen you cast a spell targeting yourself, you can also affect your Primal Companion beast with the spell if the beast is within 30 feet of you.\n"
  },
  {
    "Id": "89ded429-4ce0-436f-82b7-1da56f6c4324",
    "Name": "Fey Wanderer",
    "ParentClass": "Ranger",
    "Source": "Player\u0027s Handbook",
    "Description": "Wield Fey Mirth and Fury\nA fey mystique surrounds you, thanks to the boon of an archfey or a location in the Feywild that transformed you. However you gained fey magic, you are now a Fey Wanderer. Your joyful laughter brightens the hearts of the downtrodden, and your martial prowess strikes terror in your foes, for great is the mirth of the fey and dreadful is their fury.\n\nYou can augment your weapon strikes with mind-scarring magic drawn from the murky hollows of the Feywild. When you hit a creature with a weapon, you can deal an extra 1d4 Psychic damage to the target, which can take this extra damage only once per turn. The extra damage increases to 1d6 when you reach Ranger level 11.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nWield Fey Mirth and Fury\nA fey mystique surrounds you, thanks to the boon of an archfey or a location in the Feywild that transformed you. However you gained fey magic, you are now a Fey Wanderer. Your joyful laughter brightens the hearts of the downtrodden, and your martial prowess strikes terror in your foes, for great is the mirth of the fey and dreadful is their fury.\nLevel 3: Dreadful Strikes\nYou can augment your weapon strikes with mind-scarring magic drawn from the murky hollows of the Feywild. When you hit a creature with a weapon, you can deal an extra 1d4 Psychic damage to the target, which can take this extra damage only once per turn. The extra damage increases to 1d6 when you reach Ranger level 11.\nLevel 3: Fey Wanderer Spells\nWhen you reach a Ranger level specified in the Fey Wanderer spells table, you thereafter always have the listed spells prepared.\nFey Wanderer Spells\n\n\nRanger Level\nSpell\n\n\n3\nCharm Person\n\n\n5\nMisty Step\n\n\n9\nSummon Fey\n\n\n13\nDimension Door\n\n\n17\nMislead\n\n\nYou also possess a fey blessing. Choose it from the Feywild Gifts table or determine it randomly.\nFeywild Gifts\n\n\n1d6\nGift\n\n\n1\nIllusory butterflies flutter around you while you take a Short or Long Rest.\n\n\n2\nFlowers bloom from your hair each dawn.\n\n\n3\nYou faintly smell of cinnamon, lavender, nutmeg, or another comforting herb or spice.\n\n\n4\nYour shadow dances while no one is looking directly at it.\n\n\n5\nHorns or antlers sprout from your head.\n\n\n6\nYour skin and hair change color each dawn.\n\n\nLevel 3: Otherworldly Glamour.\nWhenever you make a Charisma check, you gain a bonus to the check equal to your Wisdom modifier (Minimum of \u002B1).\nYou also gain proficiency in one of these skills of your choice: Deception, Performance, or Persuasion.\nLevel 7: Beguiling Twist\nThe magic of the Feywild guards your mind. You have advantage on saving throws to avoid or end the Charmed or Frightened condition.\nIn addition, whenever you or a creature you can see within 120 feet of you succeeds on a saving throw to avoid or end the Charmed or Frightened condition, you can take a Reaction to force a different creature you can see within 120 feet of yourself to make a Wisdom save against your spell save DC. On a failed save, the target is charmed or frightened (your choice) for 1 minute. The target repeats the save at the end of each of its turns, ending the effect on itself on a success.\nLevel 11: Fey Reinforcements\nYou can cast Summon Fey without a Material component. You can also cast it once without a spell slot, and you regain the ability to cast it in this way when you finish a Long Rest.\nWhenever you start casting the spell, you can modify it so that it doesn\u0027t require Concentration. If you do so, the spell\u0027s duration becomes 1 minute for the casting.\nLevel 15: Misty Wanderer\nYou can cast Misty Step without expending a spell slot. You can do so a number of times equal to your Wisdom modifier (minimum of once), and you regain all expended uses when you finish a Long Rest.\nIn addition, whenever you cast Misty Step, you can bring along one willing creature you can see within 5 feet of yourself. That creature teleports to an unoccupied space of your choice within 5 feet of your destination space.\n"
  },
  {
    "Id": "f814aaf0-ed6e-4b87-878c-e2f71ccd4b9c",
    "Name": "Gloom Stalker",
    "ParentClass": "Ranger",
    "Source": "Player\u0027s Handbook",
    "Description": "Draw on Shadow Magic to Fight Your Foes\n\nGloom Stalkers are at home in the darkest places, wielding magic drawn from the Shadowfell to combat enemies that lurk in darkness.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nDraw on Shadow Magic to Fight Your Foes\nGloom Stalkers are at home in the darkest places, wielding magic drawn from the Shadowfell to combat enemies that lurk in darkness.\nLevel 3: Dread Ambusher\nYou have mastered the art of creating fearsome ambushes, granting you the following benefits.\nAmbusher\u0027s Leap. At the start of your first turn of each combat, your speed increases by 10 feet until the end of that turn.\nDreadful Strike. When you attack a creature and hit it with a weapon, you can deal an extra 2d6 Psychic damage. You can use this benefit only once per turn, you can use it a number of times equal to your Wisdom modifier (minimum of once), and you regain all expended uses when you finish a Long Rest.\nInitiative Bonus. When you roll Initiative, you can add your Wisdom modifier to the roll.\nLevel 3: Gloom Stalker Spells\nWhen you reach a Ranger level specified in the Gloom Stalker spells table, you thereafter always have the listed spells prepared.\nGloom Stalker Spells\n\n\nRanger Level\nSpells\n\n\n3\nDisguise Self\n\n\n5\nRope Trick\n\n\n9\nFear\n\n\n13\nGreater Invisibility\n\n\n17\nSeeming\n\n\nLevel 3: Umbral Sight\nYou gain Darkvision with a range of 60 feet. If you already have Darkvision when you gain this feature, its range increases by 60 feet.\nYou are also adept at evading creatures that rely on Darkvision. While entirely in Darkness, you have the Invisible condition to any creature that relies on Darkvision to see you in that Darkness.\nLevel 7: Iron Mind\nYou have honed your ability to resist mind-altering powers. You gain proficiency in Wisdom saving throws. If you already have this proficiency, you instead gain proficiency in Intelligence or Charisma saving throws (your choice).\nLevel 11: Stalker\u0027s Flurry\nThe Psychic damage of your Dreadful Strike becomes 2d8. In addition, when you use the Dreadful Strike effect of your Dread Ambusher feature, you can use one of the following additional effects.\nSudden Strike. You can make another attack with the same weapon against a different creature that is within 5 feet of the original target and that is within the weapon\u0027s range.\nMass Fear. The target and each creature within 10 feet of it must make a wisdom saving throw against your spell save DC. On a failed save, a creature has the Frightened condition until the start of your next turn.\nLevel 15: Shadowy Dodge\nWhen a creature makes an attack roll against you, you can take a Reaction to impose Disadvantage on that roll. Whether the attack hits or misses, you can teleport up to 30 feet to an unoccupied space that you can see.\n"
  },
  {
    "Id": "f8a8e205-ee02-4b96-b3e4-bc0638d74160",
    "Name": "Hunter",
    "ParentClass": "Ranger",
    "Source": "Player\u0027s Handbook",
    "Description": "Protect Nature and People from Destruction\nYou stalk prey in the wilds and elsewhere, using your abilities as a Hunter to protect nature and people everywhere from forces that would destroy them.\n\nYou can call upon the forces of nature to reveal certain strengths and weaknesses of your prey. While a creature is marked by your Hunter\u0027s Mark, you know whether the creature has any Immunities, Resistances, or Vulnerabilities, and if the creature has any, you know what they are.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nProtect Nature and People from Destruction\nYou stalk prey in the wilds and elsewhere, using your abilities as a Hunter to protect nature and people everywhere from forces that would destroy them.\nLevel 3: Hunter\u0027s Lore\nYou can call upon the forces of nature to reveal certain strengths and weaknesses of your prey. While a creature is marked by your Hunter\u0027s Mark, you know whether the creature has any Immunities, Resistances, or Vulnerabilities, and if the creature has any, you know what they are.\nLevel 3: Hunter\u0027s Prey\nYou gain one of the following feature options of your choice. Whenever you finish a Short or Long Rest, you can replace the chosen option with the other one.\nColossus Slayer. Your tenacity can wear down even the most resilient foes. When you hit a creature with a weapon, the weapon deals an extra 1d8 damage to the target if it\u0027s missing any of its Hit Points. You can deal this extra damage only once per turn.\nHorde Breaker. Once on each of your turns when you make an attack with a weapon, you can make another attack with the same weapon against a different creature that is within 5 feet of the original target, that is within the weapon\u0027s range, and that you haven\u0027t attacked this turn.\nLevel 7: Defensive Tactics\nYou gain one of the following feature options of your choice. Whenever you finish a Short or Long Rest, you can replace the chosen option with the other one.\nEscape the Horde. Opportunity Attacks have Disadvantage against you.\nMultiattack Defense. When a creature hits you with an attack roll, that creature has Disadvantage on all other attack rolls against you this turn.\nLevel 11: Superior Hunter\u0027s Prey\nOnce per turn when you deal damage to a creature marked by your Hunter\u0027s Mark, you can also deal that spell\u0027s extra damage to a different creature that you can see within 30 feet of the first creature.\nLevel 15: Superior Hunter\u0027s Defense\nWhen you take damage, you can take a Reaction to give yourself Resistance to that damage and any other damage of the same type until the end of the current turn.\n"
  },
  {
    "Id": "b808b291-2bdd-4b21-8db2-3ac3de6ed576",
    "Name": "Arcane Trickster",
    "ParentClass": "Rogue",
    "Source": "Player\u0027s Handbook",
    "Description": "Enhance Stealth with Arcane Spells\nSome Rogues enhance their fine-honed skills of stealth and agility with spells, learning magical tricks to aid them in their trade. Some Arcane Tricksters use their talents as pickpockets and burglars, while others are pranksters.\n\nYou have learned to cast spells. See chapter 7 for the rules on spellcasting. The information below details how you use those rules as an Arcane Trickster.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nEnhance Stealth with Arcane Spells\nSome Rogues enhance their fine-honed skills of stealth and agility with spells, learning magical tricks to aid them in their trade. Some Arcane Tricksters use their talents as pickpockets and burglars, while others are pranksters.\nLevel 3: Spellcasting\nYou have learned to cast spells. See chapter 7 for the rules on spellcasting. The information below details how you use those rules as an Arcane Trickster.\nCantrips. You know three cantrips: Mage Hand and two other cantrips of your choice from the Wizard spell list (See that class\u0027s section for its list). Mind Sliver and Minor Illusion are recommended.\nWhenever you gain a Rogue level, you can replace one of your cantrips, except Mage Hand, with another Wizard cantrip of your choice.\nWhen you reach Rogue level 10, you learn another Wizard cantrip of your choice.\nSpell Slots. The Arcane Trickster Spellcasting table shows how many spell slots you have to cast your level 1\u002B spells. You regain all expended spell slots when you finish a Long Rest.\nPrepared Spells of Level 1\u002B. You prepare a list of the level 1\u002B spells that are available for you to cast with this feature. To start, choose three level 1 Wizard spells. Charm Person, Disguise Self and Fog Cloud are recommended.\nThe number of spells on your list increases as you gain Rogue levels, as shown in the Prepared Spells column of the Arcane Trickster Spellcasting table. Whenever that number increases, choose additional Wizard spells until the number of spells on your list matches the number in the Arcane Trickster Spellcasting table. The chosen spells must be of a level for which you have spell slots. For example, if you\u0027re a level 7 Rogue, your list of prepared spells can include five Wizard spells of level 1 or 2 in any combination.\nChanging Your Prepared Spells. Whenever you gain a Rogue level, you can replace one spell on your list with another Wizard spell for which you have spell slots.\nSpellcasting Ability. Intelligence is your Spellcasting ability for your Wizard Spells.\nSpellcasting Focus. You can use an Arcane Focus as a Spellcasting Focus for your Wizard Spells.\nArcane Trickster Spellcasting\n\n\nRogue Level\nPrepared Spells\n1st\n2nd\n3rd\n4th\n\n\n3\n3\n2\n-\n-\n-\n\n\n4\n4\n3\n-\n-\n-\n\n\n5\n4\n3\n-\n-\n-\n\n\n6\n4\n3\n-\n-\n-\n\n\n7\n5\n4\n2\n-\n-\n\n\n8\n6\n4\n2\n-\n-\n\n\n9\n6\n4\n2\n-\n-\n\n\n10\n7\n4\n3\n-\n-\n\n\n11\n8\n4\n3\n-\n-\n\n\n12\n8\n4\n3\n-\n-\n\n\n13\n9\n4\n3\n2\n-\n\n\n14\n10\n4\n3\n2\n-\n\n\n15\n10\n4\n3\n2\n-\n\n\n16\n11\n4\n3\n3\n-\n\n\n17\n11\n4\n3\n3\n-\n\n\n18\n11\n4\n3\n3\n-\n\n\n19\n12\n4\n3\n3\n1\n\n\n20\n13\n4\n3\n3\n1\n\n\nLevel 3: Mage Hand Legerdemain\nWhen you cast Mage Hand, you can cast it as a Bonus Action, and you can make the spectral hand Invisible. You can control the hand as a Bonus Action, and through it, you can make Dexterity (Sleight of Hand) checks.\nLevel 9: Magical Ambush\nIf you have the Invisible condition when you cast a spell on a creature, it has Disadvantage on any saving throw it makes against the spell on the same turn.\nLevel 13: Versatile Trickster\nYou gain the ability to distract targets with your Mage Hand. When you use the Trip option of your Cunning Strike on a creature, you can also use that option on another creature within 5 feet of the spectral hand.\nLevel 17: Spell Thief\nYou gain the ability to magically steal the knowledge of how to cast a spell from another spellcaster.\nImmediately after a creature casts a spell that targets you or includes you in its area of effect, you can take a Reaction to force the creature to make an Intelligence saving throw. The DC equals your spell save DC. On a failed save, you negate the spell\u0027s effect against you, and you steal the knowledge of the spell if it is at least level 1 and of a level you can cast (it doesn\u0027t need to be a Wizard spell). For the next 8 hours, you have the spell prepared. The creature can\u0027t cast it until 8 hours have passed.\nOnce you steal a spell with this feature, you can\u0027t use this feature again until you finish a Long Rest.\n"
  },
  {
    "Id": "bbfbb310-46eb-46d1-b884-48b546a02999",
    "Name": "Assassin",
    "ParentClass": "Rogue",
    "Source": "Player\u0027s Handbook",
    "Description": "Practice the Grim Art of Death\nAn Assassin\u0027s training focuses on using stealth, poison, and disguise to eliminate foes with deadly efficiency. While some Rogues who follow this path are hired killers, spies, or bounty hunters, the capabilities of this subclass are equally useful for adventurers facing a variety of monstrous enemies.\n\nYou\u0027re adept at ambushing a target, granting you the following benefits.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nPractice the Grim Art of Death\nAn Assassin\u0027s training focuses on using stealth, poison, and disguise to eliminate foes with deadly efficiency. While some Rogues who follow this path are hired killers, spies, or bounty hunters, the capabilities of this subclass are equally useful for adventurers facing a variety of monstrous enemies.\nLevel 3: Assassinate\nYou\u0027re adept at ambushing a target, granting you the following benefits.\nInitiative. You have Advantage on Initiative rolls.\nSurprising Strikes. During the first round of each combat, you have Advantage on attack rolls against any creature that hasn\u0027t taken a turn. If your Sneak Attack hits any target during that round, the target takes extra damage of the weapon\u0027s type equal to your Rogue level.\nLevel 3: Assassin\u0027s Tools\nYou gain a Disguise Kit and a Poisoner\u0027s Kit, and you have proficiency with them.\nLevel 9: Infiltration Expertise\nYou are an expert at the following techniques that aid your infiltrations.\nMasterful Mimicry. You can unerringly mimic another person\u0027s speech, handwriting or both if you have spent at least 1 hour studying them.\nRoving Aim. Your speed isn\u0027t reduced to 0 by using Steady Aim.\nLevel 13: Envenom Weapons\nWhen you use the Poison option of your Cunning Strike, the target also takes 2d6 Poison damage whenever it fails the saving throw. This damage ignores Resistance to Poison damage.\nLevel 17: Death Strike\nWhen you hit with your Sneak Attack on the first round of a combat, the target must succeed on a Constitution saving throw (DC 8 plus your Dexterity modifier and Proficiency Bonus), or the attack\u0027s damage is doubled against the target.\n"
  },
  {
    "Id": "e2f39cf0-e219-4bc3-ba39-fc0158d55741",
    "Name": "Soulknife",
    "ParentClass": "Rogue",
    "Source": "Player\u0027s Handbook",
    "Description": "Strike Foes with Psionic Blades\nA Soulknife strikes with the mind, cutting through barriers both physical and psychic. These Rogues discover psionic power within themselves and channel it to do their roguish work. As a Soulknife your psionic abilities might have haunted you since childhood, revealing their full potential only as you experienced the stress of adventure. Or you might have sought out an order of psychic adepts and spent years learning how to manifest your power.\n\nYou harbor a wellspring of psionic energy within yourself. It is represented by your Psionic Energy Dice, which fuel certain powers you have from this subclass. The Soulknife Energy Dice table shows the number of these dice you have when you reach certain Rogue levels, and the table shows the die size.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nStrike Foes with Psionic Blades\nA Soulknife strikes with the mind, cutting through barriers both physical and psychic. These Rogues discover psionic power within themselves and channel it to do their roguish work. As a Soulknife your psionic abilities might have haunted you since childhood, revealing their full potential only as you experienced the stress of adventure. Or you might have sought out an order of psychic adepts and spent years learning how to manifest your power.\nLevel 3: Psionic Power\nYou harbor a wellspring of psionic energy within yourself. It is represented by your Psionic Energy Dice, which fuel certain powers you have from this subclass. The Soulknife Energy Dice table shows the number of these dice you have when you reach certain Rogue levels, and the table shows the die size.\nSoulknife Energy Dice\n\n\nRogue Level\nDie Size\nNumber\n\n\n3\nD6\n4\n\n\n5\nD8\n6\n\n\n9\nD8\n8\n\n\n11\nD10\n8\n\n\n13\nD10\n10\n\n\n17\nD12\n12\n\n\nAny features in this subclass that use a Psionic Energy Die use only the dice from this subclass. Some of your powers expend a Psionic Energy Die, as specified in the power\u0027s description, and you can\u0027t use the power if it requires you to use a die when your Psionic Energy Dice are all expended.\nYou regain one of your expended Psionic Energy Dice when you finish a Short Rest, and you regain all of them when you finish a Long Rest.\nPsi-Bolstered Knack. If you fail an ability check using a skill or tool with which you have proficiency, you can roll one Psionic Energy Die and add the number rolled to the check, potentially turning failure into success. The die is expended only if the roll then succeeds.\nPsychic Whispers. You can establish telepathic communication between yourself and others. As a Magic action, choose one or more creatures you can see, up to a number of creatures equal to your Proficiency Bonus, and then roll one Psionic Energy Die. For a number of hours equal to the number rolled, the chosen creatures can speak telepathically to you, and you can speak telepathically with them. To send or receive a message (no action required), you and the other creature must be within 1 mile of each other. A creature can end the telepathic connection at any time (no action required).\nLevel 3: Psychic Blades\nYou can manifest shimmering blades of psychic energy. Whenever you take the Attack action or make an Opportunity Attack, you can manifest a Psychic Blade in your free hand and make the attack with that blade. The magic blade has the following traits:\nWeapon Category: Simple Melee\nDamage on a Hit: 1d6 Psychic plus the ability modifier used for the attack roll\nProperties: Finesse, Thrown (range 60/120 feet)\nMastery: Vex (you can use this property, and it doesn\u0027t count against the number of properties you can use with Weapon Mastery)\nThe blade vanishes immediately after it hits or misses its target, and it leaves no mark if it deals damage.\nAfter you attack with the blade on your turn, you can make a melee or ranged attack with a second psychic blade as a Bonus Action on the same turn if your other hand is free to create it. The damage die of this bonus attack is 1d4 instead of 1d6.\nLevel 9: Soul Blades\nYou can now use the following powers with your Psychic Blades.\nHoming Strikes. If you make an attack roll with your Psychic Blade and miss the target, you can roll one Psionic Energy Die and add the number rolled to the attack roll. If this causes the attack to hit, the die is expended.\nPsychic Teleportation. As a Bonus Action, you manifest a Psychic Blade, expend one Psionic Energy Die and roll it, and throw the blade at an unoccupied space you can see up to a number of feet away equal to 10 times the number rolled. You then teleport to that space, and the blade vanishes.\nLevel 13: Psychic Veil\nYou can weave a veil of psychic static to mask yourself. As a Magic action, you gain the Invisible condition for 1 hour or until you dismiss the effect (no action required). This invisibility ends early immediately after you deal damage to a creature or you force a creature to make a saving throw.\nOnce you use this feature, you can\u0027t do so again until you finish a Long Rest unless you expend a Psionic Energy Die (no action required) to restore your use of it.\nLevel 17: Rend Mind\nYou can sweep your Psychic Blades through a creature\u0027s mind. When you use you Psychic Blades to deal Sneak Attack damage to a creature, you can force that target to make a Wisdom saving throw (DC 8 plus your Dexterity modifier and Proficiency Bonus). If the save fails, the target has the Stunned condition for 1 minute. The Stunned target repeats the save at the end of each of its turns, ending the effect on itself with a success.\nOnce you use this feature, you can\u0027t do so again until you finish a Long Rest unless you expend three Psionic Energy Dice (no action required) to restore your use of it.\n"
  },
  {
    "Id": "198ce744-2d3c-47d3-9cb0-e96860515f28",
    "Name": "Thief",
    "ParentClass": "Rogue",
    "Source": "Player\u0027s Handbook",
    "Description": "Hunt for Treasure as a Classic Adventurer\nA mix of burglar, treasure hunter, and explorer, you are the epitome of an adventurer. In addition to improving your agility and stealth, you gain abilities useful for delving into ruins and getting maximum benefit from the magic items you find there.\n\nAs a Bonus Action, you can do one of the following.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nHunt for Treasure as a Classic Adventurer\nA mix of burglar, treasure hunter, and explorer, you are the epitome of an adventurer. In addition to improving your agility and stealth, you gain abilities useful for delving into ruins and getting maximum benefit from the magic items you find there.\nLevel 3: Fast Hands\nAs a Bonus Action, you can do one of the following.\nSleight of Hand. Make a Dexterity (Sleight of Hand) check to pick a lock or disarm a trap with Thieves\u0027 Tools or to pick a pocket.\nUse an Object. Take the Utilize action, or take the Magic action to use a magic item that requires an action.\nLevel 3: Second Story Work\nYou\u0027ve trained to get into especially hard-to-reach places, granting you these benefits.\nClimber. You gain a Climb Speed equal to your Speed.\nJumper. You can determine your jump distance using your Dexterity rather than your Strength.\nLevel 9: Supreme Sneak\nYou gain the following Cunning Strike option.\nStealth Attack (Cost: 1d6). If you have the Hide action\u0027s Invisible condition, this attack doesn\u0027t end that condition on you if you end the turn behind Three-Quarters Cover or Total Cover.\nLevel 13: Use Magic Device\nYou\u0027ve learned how to maximize use of magic items, granting you the following benefits.\nAttunement. You can attune to up to four magic items at once.\nCharges. Whenever you use a magic item property that expends charges, roll 1d6. On a roll of 6, you use the property without expending the charges.\nScrolls. You can use any Spell Scroll, using Intelligence as your spellcasting ability for the spell. If the spell is a cantrip or a level 1 spell, you can cast it reliably. If the scroll contains a higher-level spell, you must first succeed on an Intelligence (Arcana) check (DC 10 plus the spell\u0027s level). On a successful check, you cast the spell from the scroll. On a failed check, the scroll disintegrates.\nLevel 17: Thief\u0027s Reflexes\nYou are adept at laying ambushes and quickly escaping danger. You can take two turns during the first round of any combat. You take your first turn at your normal Initiative and your second turn at your Initiative minus 10.\n"
  },
  {
    "Id": "72c3512c-d324-4a77-91d7-756ab5abe103",
    "Name": "Aberrant Sorcery",
    "ParentClass": "Sorcerer",
    "Source": "Player\u0027s Handbook",
    "Description": "Wield Unnatural Psionic Power\n\nAn alien influence has wrapped its tendrils around your mind, giving you psionic power. You can now touch other minds with that power and alter the world around you. Will this power shine from you as a hopeful beacon to others? Or will you be a terror to those who feel the stab of your mind?",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nWield Unnatural Psionic Power\nAn alien influence has wrapped its tendrils around your mind, giving you psionic power. You can now touch other minds with that power and alter the world around you. Will this power shine from you as a hopeful beacon to others? Or will you be a terror to those who feel the stab of your mind?\nPerhaps a psychic wind from the Astral Plane carried psionic energy to you, or you were exposed to the Far Realm’s warping influence. Alternatively, you were implanted with a mind flayer tadpole, but your transformation into a mind flayer never occurred; now the tadpole’s psionic power is yours. However you acquired this power, your mind is aflame with it.\nLevel 3: Psionic Spells\nWhen you reach a Sorcerer level specified in the Psionic Spells table, you thereafter always have the listed spells prepared.\nPsionic Spells\n\n\nSorcerer Level\nSpells\n\n\n3\nArms of Hadar, Calm Emotions, Detect Thoughts, Dissonant Whispers, Mind Sliver\n\n\n5\nHunger of Hadar, Sending\n\n\n7\nEvard\u0027s Black Tentacles, Summon Aberration\n\n\n9\nRary\u0027s Telepathic Bond, Telekinesis\n\n\nLevel 3: Telepathic Speech\nYou can form a telepathic connection between your mind and the mind of another. As a Bonus Action, choose one creature you can see within 30 feet of yourself. You and the chosen creature can communicate telepathically with each other while the two of you are within a number of miles of each other equal to your Charisma modifier (minimum of 1 mile). To understand each other, you each must mentally use a language the other knows.\nThe telepathic connection lasts for a number of minutes equal to your Sorcerer level. It ends early if you use this ability to form a connection with a different creature.\nLevel 6: Psionic Sorcery\nWhen you cast any level 1\u002B spell from your Psionic Spells feature, you can cast it by expending a spell slot as normal or by spending a number of Sorcery Points equal to the spell’s level. If you cast the spell using Sorcery Points, it requires no Verbal or Somatic components, and it requires no Material components unless they are consumed by the spell or have a cost specified in it.\nLevel 6: Psychic Defenses\nYou have Resistance to Psychic damage, and you have Advantage on saving throws to avoid or end the Charmed or Frightened condition.\nLevel 14: Revelation in Flesh\nYou can unleash the aberrant truth hidden within yourself. As a Bonus Action, you can spend 1 Sorcery Point or more to magically alter your body for 10 minutes. For each Sorcery Point you spend, you gain one of the following benefits of your choice, the effects of which last until the alteration ends.\nAquatic Adaptation. You gain a Swim Speed equal to twice your Speed, and you can breathe underwater. Gills grow from your neck or flare behind your ears, and your fingers become webbed or you grow wriggling cilia.\nGlistening Flight. You gain a Fly Speed equal to your Speed, and you can hover. As you fly, your skin glistens with mucus or otherworldly light.\nSee the Invisible. You can see any Invisible creature within 60 feet of yourself that isn’t behind Total Cover. Your eyes also turn black or become writhing sensory tendrils.\nWormlike Movement. Your body, along with any equipment you are wearing or carrying, becomes slimy and pliable. You can move through any space as narrow as 1 inch, and you can spend 5 feet of movement to escape from nonmagical restraints or the Grappled condition.\nLevel 18: Warping Implosion\nYou can unleash a space-warping anomaly. As a Magic action, you teleport to an unoccupied space you can see within 120 feet of yourself. Immediately after you disappear, each creature within 30 feet of the space you left must make a Strength saving throw against your spell save DC. On a failed save, a creature takes 3d10 Force damage and is pulled straight toward the space you left, ending in an unoccupied space as close to your former space as possible. On a successful save, the creature takes half as much damage only.\nOnce you use this feature, you can’t do so again until you finish a Long Rest unless you spend 5 Sorcery Points (no action required) to restore your use of it.\n"
  },
  {
    "Id": "0c0e3b45-18f1-4c4e-9aab-01777190ef4a",
    "Name": "Clockwork Sorcery",
    "ParentClass": "Sorcerer",
    "Source": "Player\u0027s Handbook",
    "Description": "Channel Cosmic Forces of Order\n\nThe cosmic force of order has suffused you with magic. That power arises from Mechanus or a realm like it—a plane of existence shaped entirely by clockwork efficiency. You or someone from your lineage might have become entangled in the machinations of modrons, the orderly beings who inhabit Mechanus. Perhaps your ancestor even took part in the Great Modron March. Whatever its origin within you, the power of order can seem strange to others, but for you, it’s part of a vast and glorious system.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nChannel Cosmic Forces of Order\nThe cosmic force of order has suffused you with magic. That power arises from Mechanus or a realm like it—a plane of existence shaped entirely by clockwork efficiency. You or someone from your lineage might have become entangled in the machinations of modrons, the orderly beings who inhabit Mechanus. Perhaps your ancestor even took part in the Great Modron March. Whatever its origin within you, the power of order can seem strange to others, but for you, it’s part of a vast and glorious system.\nLevel 3: Clockwork Spells\nWhen you reach a Sorcerer level specified in the Clockwork Spells table, you thereafter always have the listed spells prepared.\nClockwork Spells\n\n\nSorcerer Level\nSpells\n\n\n3\nAid, Alarm, Lesser Restoration, Protection from Evil and Good\n\n\n5\nDispel Magic, Protection from Energy\n\n\n7\nFreedom of Movement, Summon Construct\n\n\n9\nGreater Restoration, Wall of Force\n\n\nIn addition, consult the Manifestations of Order table and choose or randomly determine a way your connection to order manifests while you are casting any of your Sorcerer spells.\nManifestations of Order\n\n\n1d6\nManifestation\n\n\n1\nSpectral cogwheels hover behind you.\n\n\n2\nThe hands of a clock spin in your eyes.\n\n\n3\nYour skin glows with a brassy sheen.\n\n\n4\nFloating equations and geometric objects overlay your body.\n\n\n5\nYour Spellcasting Focus temporarily takes the form of a Tiny clockwork mechanism.\n\n\n6\nThe ticking of gears or ringing of a clock can be heard by you and those affected by your magic.\n\n\nLevel 3: Restore Balance\nYour connection to the plane of absolute order allows you to equalize chaotic moments. When a creature you can see within 60 feet of yourself is about to roll a d20 with Advantage or Disadvantage, you can take a Reaction to prevent the roll from being affected by Advantage and Disadvantage.\nYou can use this feature a number of times equal to your Charisma modifier (minimum of once), and you regain all expended uses when you finish a Long Rest.\nLevel 6: Bastion of Law\nYou can tap into the grand equation of existence to imbue a creature with a shimmering shield of order. As a Magic action, you can expend 1 to 5 Sorcery Points to create a magical ward around yourself or another creature you can see within 30 feet of yourself. The ward is represented by a number of d8s equal to the number of Sorcery Points spent to create it. When the warded creature takes damage, it can expend a number of those dice, roll them, and reduce the damage taken by the total rolled on those dice.\nThe ward lasts until you finish a Long Rest or until you use this feature again.\nLevel 14: Trance of Order\nYou gain the ability to align your consciousness with the endless calculations of Mechanus. As a Bonus Action, you can enter this state for 1 minute. For the duration, attack rolls against you can’t benefit from Advantage, and whenever you make a D20 Test, you can treat a roll of 9 or lower on the d20 as a 10.\nOnce you use this feature, you can’t use it again until you finish a Long Rest unless you spend 5 Sorcery Points (no action required) to restore your use of it.\nLevel 18: Clockwork Cavalcade\nYou momentarily summon spirits of order to expunge disorder around you. As a Magic action, you summon the spirits in a 30-foot Cube originating from you. The spirits look like modrons or other Constructs of your choice. The spirits are intangible and invulnerable, and they create the effects below within the Cube before vanishing. Once you use this action, you can’t use it again until you finish a Long Rest unless you spend 7 Sorcery Points (no action required) to restore your use of it.\nHeal. The spirits restore up to 100 Hit Points, divided as you choose among any number of creatures of your choice in the Cube.\nRepair. Any damaged objects entirely in the Cube are repaired instantly.\nDispel. Every spell of level 6 and lower ends on creatures and objects of your choice in the Cube.\n"
  },
  {
    "Id": "0aa5bc4d-10fa-4350-9e76-5c4b0235b39b",
    "Name": "Draconic Sorcery",
    "ParentClass": "Sorcerer",
    "Source": "Player\u0027s Handbook",
    "Description": "Breathe the Magic of Dragons\n\nYour innate magic comes from the gift of a dragon. Perhaps an ancient dragon facing death bequeathed some of its magical power to you or your ancestor. You might have absorbed magic from a site infused with dragons’ power. Or perhaps you handled a treasure taken from a dragon’s hoard that was steeped in draconic power. Or you might have a dragon for an ancestor.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nBreathe the Magic of Dragons\nYour innate magic comes from the gift of a dragon. Perhaps an ancient dragon facing death bequeathed some of its magical power to you or your ancestor. You might have absorbed magic from a site infused with dragons’ power. Or perhaps you handled a treasure taken from a dragon’s hoard that was steeped in draconic power. Or you might have a dragon for an ancestor.\nLevel 3: Draconic Resilience\nThe magic in your body manifests physical traits of your draconic gift. Your Hit Point maximum increases by 3, and it increases by 1 whenever you gain another Sorcerer level.\nParts of you are also covered by dragon-like scales. While you aren’t wearing armor, your base Armor Class equals 10 plus your Dexterity and Charisma modifiers.\nLevel 3: Draconic Spells\nWhen you reach a Sorcerer level specified in the Draconic Spells table, you thereafter always have the listed spells prepared.\nDraconic Spells\n\n\nSorcerer Level\nSpells\n\n\n3\nAlter Self, Chromatic Orb, Command, Dragon\u0027s Breath\n\n\n5\nFear, Fly\n\n\n7\nArcane Eye, Charm Monster\n\n\n9\nLegend Lore, Summon Dragon\n\n\nLevel 6: Elemental Affinity\nYour draconic magic has an affinity with a damage type associated with dragons. Choose one of those types: Acid, Cold, Fire, Lightning, or Poison.\nYou have Resistance to that damage type, and when you cast a spell that deals damage of that type, you can add your Charisma modifier to one damage roll of that spell.\nLevel 14: Dragon Wings\nAs a Bonus Action, you can cause draconic wings to appear on your back. The wings last for 1 hour or until you dismiss them (no action required). For the duration, you have a Fly Speed of 60 feet.\nOnce you use this feature, you can’t use it again until you finish a Long Rest unless you spend 3 Sorcery Points (no action required) to restore your use of it.\nLevel 18: Dragon Companion\nYou can cast Summon Dragon without a Material component. You can also cast it once without a spell slot, and you regain the ability to cast it in this way when you finish a Long Rest.\nWhenever you start casting the spell, you can modify it so that it doesn’t require Concentration. If you do so, the spell’s duration becomes 1 minute for that casting.\n"
  },
  {
    "Id": "0737bc77-ab89-4680-bc9f-db301ce23166",
    "Name": "Wild Magic Sorcery",
    "ParentClass": "Sorcerer",
    "Source": "Player\u0027s Handbook",
    "Description": "Unleash Chaotic Magic\n\nYour innate magic stems from the forces of chaos that underlie the order of creation. You or an ancestor might have endured exposure to raw magic, perhaps through a planar portal leading to Limbo or the Elemental Planes. Perhaps you were blessed by a fey being or marked by a demon. Or your magic could be a fluke with no apparent cause. Whatever its source, this magic churns within you, waiting for any outlet.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nUnleash Chaotic Magic\nYour innate magic stems from the forces of chaos that underlie the order of creation. You or an ancestor might have endured exposure to raw magic, perhaps through a planar portal leading to Limbo or the Elemental Planes. Perhaps you were blessed by a fey being or marked by a demon. Or your magic could be a fluke with no apparent cause. Whatever its source, this magic churns within you, waiting for any outlet.\nLevel 3: Wild Magic Surge\nYour spellcasting can unleash surges of untamed magic. Once per turn, you can roll 1d20 immediately after you cast a Sorcerer spell with a spell slot. If you roll a 20, roll on the Wild Magic Surge table to create a magical effect.\nIf the magical effect is a spell, it is too wild to be affected by your Metamagic.\nLevel 3: Tides of Chaos\nYou can manipulate chaos itself to give yourself Advantage on one D20 Test before you roll the d20. Once you do so, you must cast a Sorcerer spell with a spell slot or finish a Long Rest before you can use this feature again.\nIf you do cast a Sorcerer spell with a spell slot before you finish a Long Rest, you automatically roll on the Wild Magic Surge table.\nLevel 6: Bend Luck\nYou have the ability to twist fate using your wild magic. Immediately after another creature you can see rolls the d20 for a D20 Test, you can take a Reaction and spend 1 Sorcery Point to roll 1d4 and apply the number rolled as a bonus or penalty (your choice) to the d20 roll.\nLevel 14: Controlled Chaos\nYou gain a modicum of control over the surges of your wild magic. Whenever you roll on the Wild Magic Surge table, you can roll twice and use either number.\nLevel 18: Tamed Surge\nImmediately after you cast a Sorcerer spell with a spell slot, you can create an effect of your choice from the Wild Magic Surge table instead of rolling on that table. You can choose any effect in the table except for the final row, and if the chosen effect involves a roll, you must make it.\nOnce you use this feature, you can’t do so again until you finish a Long Rest.\nWild Magic Surge\n\n\n1d100\nEffect\n\n\n01-04\nRoll on this table at the start of each of your turns for the next minute, ignoring this result on subsequent rolls.\n\n\n05-08\nA creature that is Friendly toward you appears in a random unoccupied space within 60 feet of you. The creature is under the DM’s control and disappears 1 minute later. Roll 1d4 to determine the creature: on a 1, a Modron Duodrone appears; on a 2, a Flumph appears; on a 3, a Modron Monodrone appears; on a 4, a Unicorn appears. See the Monster Manual for the creature’s stat block.\n\n\n09-12\nFor the next minute, you regain 5 Hit Points at the start of each of your turns.\n\n\n13-16\nCreatures have Disadvantage on saving throws against the next spell you cast in the next minute that involves a saving throw.\n\n\n17-20\nYou are subjected to an effect that lasts for 1 minute unless its description says otherwise. Roll 1d8 to determine the effect: on a 1, you’re surrounded by faint, ethereal music only you and creatures within 5 feet of you can hear; on a 2, your size increases by one size category; on a 3, you grow a long beard made of feathers that remains until you sneeze, at which point the feathers explode from your face and vanish; on a 4, you must shout when you speak; on a 5, illusory butterflies flutter in the air within 10 feet of you; on a 6, an eye appears on your forehead, granting you Advantage on Wisdom (Perception) checks; on an 7, pink bubbles float out of your mouth whenever you speak; on an 8, your skin turns a vibrant shade of blue for 24 hours or until the effect is ended by a Remove Curse spell.\n\n\n21-24\nFor the next minute, all your spells with a casting time of an action have a casting time of a Bonus Action.\n\n\n25-28\nYou are transported to the Astral Plane until the end of your next turn. You then return to the space you previously occupied or the nearest unoccupied space if that space is occupied.\n\n\n29-32\nThe next time you cast a spell that deals damage within the next minute, don’t roll the spell’s damage dice for the damage. Instead use the highest number possible for each damage die.\n\n\n33-36\nYou have Resistance to all damage for the next minute.\n\n\n37-40\nYou turn into a potted plant until the start of your next turn. While you’re a plant, you have the Incapacitated condition and have Vulnerability to all damage. If you drop to 0 Hit Points, your pot breaks, and your form reverts.\n\n\n41-44\nFor the next minute, you can teleport up to 20 feet as a Bonus Action on each of your turns.\n\n\n45-48\nYou and up to three creatures you choose within 30 feet of you have the Invisible condition for 1 minute. This invisibility ends on a creature immediately after it makes an attack roll, deals damage, or casts a spell.\n\n\n49-52\nA spectral shield hovers near you for the next minute, granting you a \u002B2 bonus to AC and immunity to Magic Missile.\n\n\n53-56\nYou can take one extra action on this turn.\n\n\n57-60\nYou cast a random spell. If the spell normally requires Concentration, it doesn’t require Concentration in this case; the spell lasts for its full duration. Roll 1d10 to determine the spell: on a 1, Confusion; on a 2, Fireball; on a 3, Fog Cloud; on a 4, Fly (cast on a random creature within 60 feet of you), on a 5, Grease; on a 6, Levitate (cast on yourself); on a 7, Magic Missile (cast as a level 5 spell); on an 8, Mirror Image; on a 9, Polymorph (cast on yourself), and if you fail the saving throw, you turn into a Goat (see appendix B); on a 10, See Invisibility.\n\n\n61-64\nFor the next minute, any flammable, nonmagical object you touch that isn’t being worn or carried by another creature bursts into flame, takes 1d4 Fire damage, and is burning.\n\n\n65-68\nIf you die within the next hour, you immediately revive as if by the Reincarnate spell.\n\n\n69-72\nYou have the Frightened condition until the end of your next turn. The DM determines the source of your fear.\n\n\n73-76\nYou teleport up to 60 feet to an unoccupied space you can see.\n\n\n77-80\nA random creature within 60 feet of you has the Poisoned condition for 1d4 hours.\n\n\n81-84\nYou radiate Bright Light in a 30-foot radius for the next minute. Any creature that ends its turn within 5 feet of you has the Blinded condition until the end of its next turn.\n\n\n85-88\nUp to three creatures of your choice that you can see within 30 feet of you take 1d10 Necrotic damage. You regain Hit Points equal to the sum of the Necrotic damage dealt.\n\n\n89-92\nUp to three creatures of your choice that you can see within 30 feet of you take 4d10 Lightning damage.\n\n\n93-96\nYou and all creatures within 30 feet of you have Vulnerability to Piercing damage for the next minute.\n\n\n97-00\nRoll 1d6: On a 1, you regain 2d10 Hit Points; on a 2, one ally of your choice within 300 feet of you regains 2d10 Hit Points; on a 3, you regain your lowest-level expended spell slot; on a 4, one ally of your choice within 300 feet of you regains their lowest-level expended spell slot; on a 5, you regain all your expended Sorcery Points; on a 6, all the effects of row 17–20 affect you simultaneously.\n\n\n"
  },
  {
    "Id": "9729669f-4b41-4f94-bf2e-c26dceab2e80",
    "Name": "Archfey Patron",
    "ParentClass": "Warlock",
    "Source": "Player\u0027s Handbook",
    "Description": "Bargain with Whimsical Fey\n\nYour pact draws on the power of the Feywild. When you choose this subclass, you might make a deal with an archfey, such as the Prince of Frost; the Queen of Air and Darkness, ruler of the Gloaming Court; Titania of the Summer Court; or an ancient hag. Or you might call on a spectrum of Fey, weaving a web of favors and debts. Whoever they are, your patron is often inscrutable and whimsical.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nBargain with Whimsical Fey\nYour pact draws on the power of the Feywild. When you choose this subclass, you might make a deal with an archfey, such as the Prince of Frost; the Queen of Air and Darkness, ruler of the Gloaming Court; Titania of the Summer Court; or an ancient hag. Or you might call on a spectrum of Fey, weaving a web of favors and debts. Whoever they are, your patron is often inscrutable and whimsical.\nLevel 3: Archfey Spells\nThe magic of your patron ensures you always have certain spells ready; when you reach a Warlock level specified in the Archfey Spells table, you thereafter always have the listed spells prepared.\nArchfey Spells\n\n\nWarlock Level\nSpells\n\n\n3\nCalm Emotions, Faerie Fire, Misty Step, Phantasmal Force, Sleep\n\n\n5\nBlink, Plant Growth\n\n\n7\nDominate Beast, Greater Invisibility\n\n\n9\nDominate Person, Seeming\n\n\nLevel 3: Steps of the Fey\nYour patron grants you the ability to move between the boundaries of the planes. You can cast Misty Step without expending a spell slot a number of times equal to your Charisma modifier (minimum of once), and you regain all expended uses when you finish a Long Rest.\nIn addition, whenever you cast that spell, you can choose one of the following additional effects.\nRefreshing Step. Immediately after you teleport, you or one creature you can see within 10 feet of yourself gains 1d10 Temporary Hit Points.\nTaunting Step. Creatures within 5 feet of the space you left must succeed on a Wisdom saving throw against your spell save DC or have Disadvantage on attack rolls against creatures other than you until the start of your next turn.\nLevel 6: Misty Escape\nYou can cast Misty Step as a Reaction in response to taking damage.\nIn addition, the following effects are now among your Steps of the Fey options.\nDisappearing Step. You have the Invisible condition until the start of your next turn or until immediately after you make an attack roll, deal damage, or cast a spell.\nDreadful Step. Creatures within 5 feet of the space you left or the space you appear in (your choice) must succeed on a Wisdom saving throw against your spell save DC or take 2d10 Psychic damage.\nLevel 10: Beguiling Defenses\nYour patron teaches you how to guard your mind and body. You are immune to the Charmed condition.\nIn addition, immediately after a creature you can see hits you with an attack roll, you can take a Reaction to reduce the damage you take by half (round down), and you can force the attacker to make a Wisdom saving throw against your spell save DC. On a failed save, the attacker takes Psychic damage equal to the damage you take. Once you use this Reaction, you can’t use it again until you finish a Long Rest unless you expend a Pact Magic spell slot (no action required) to restore your use of it.\nLevel 14: Bewitching Magic\nYour patron grants you the ability to weave your magic with teleportation. Immediately after you cast an Enchantment or Illusion spell using an action and a spell slot, you can cast Misty Step as part of the same action and without expending a spell slot.\n"
  },
  {
    "Id": "8cda87de-600f-42b8-837f-6727484527cd",
    "Name": "Celestial Patron",
    "ParentClass": "Warlock",
    "Source": "Player\u0027s Handbook",
    "Description": "Call on the Power of the Heavens\n\nYour pact draws on the Upper Planes, the realms of everlasting bliss. You might enter an agreement with an empyrean, a couatl, a sphinx, a unicorn, or another heavenly entity. Or you might call on numerous such beings as you pursue goals aligned with theirs. Your pact allows you to experience a hint of the holy light that illuminates the multiverse.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nCall on the Power of the Heavens\nYour pact draws on the Upper Planes, the realms of everlasting bliss. You might enter an agreement with an empyrean, a couatl, a sphinx, a unicorn, or another heavenly entity. Or you might call on numerous such beings as you pursue goals aligned with theirs. Your pact allows you to experience a hint of the holy light that illuminates the multiverse.\nLevel 3: Celestial Spells\nThe magic of your patron ensures you always have certain spells ready; when you reach a Warlock level specified in the Celestial Spells table, you thereafter always have the listed spells prepared.\nCelestial Spells\n\n\nWarlock Level\nSpells\n\n\n3\nAid, Cure Wounds, Guiding Bolt, Lesser Restoration, Light, Sacred Flame\n\n\n5\nDaylight, Revivify\n\n\n7\nGuardian of Faith, Wall of Fire\n\n\n9\nGreater Restoration, Summon Celestial\n\n\nLevel 3: Healing Light\nYou gain the ability to channel celestial energy to heal wounds. You have a pool of d6s to fuel this healing. The number of dice in the pool equals 1 plus your Warlock level.\nAs a Bonus Action, you can heal yourself or one creature you can see within 60 feet of yourself, expending dice from the pool. The maximum number of dice you can expend at once equals your Charisma modifier (minimum of one die). Roll the dice you expend, and restore a number of Hit Points equal to the roll’s total. Your pool regains all expended dice when you finish a Long Rest.\nLevel 6: Radiant Soul\nYour link to your patron allows you to serve as a conduit for radiant energy. You have Resistance to Radiant damage. Once per turn, when a spell you cast deals Radiant or Fire damage, you can add your Charisma modifier to that spell’s damage against one of the spell’s targets.\nLevel 10: Celestial Resilience\nYou gain Temporary Hit Points whenever you use your Magical Cunning feature or finish a Short or Long Rest. These Temporary Hit Points equal your Warlock level plus your Charisma modifier. Additionally, choose up to five creatures you can see when you gain the points. Those creatures each gain Temporary Hit Points equal to half your Warlock level plus your Charisma modifier.\nLevel 14: Searing Vengeance\nWhen you or an ally within 60 feet of you is about to make a Death Saving Throw, you can unleash radiant energy to save the creature. The creature regains Hit Points equal to half its Hit Point maximum and can end the Prone condition on itself. Each creature of your choice that is within 30 feet of the creature takes Radiant damage equal to 2d8 plus your Charisma modifier, and each has the Blinded condition until the end of the current turn.\nOnce you use this feature, you can’t use it again until you finish a Long Rest.\n"
  },
  {
    "Id": "724fb3fa-d084-4a20-8f51-17e12706d509",
    "Name": "Fiend Patron",
    "ParentClass": "Warlock",
    "Source": "Player\u0027s Handbook",
    "Description": "Make a Deal with the Lower Planes\n\nYour pact draws on the Lower Planes, the realms of perdition. You might forge a bargain with a demon lord such as Demogorgon or Orcus; an archdevil such as Asmodeus; or a pit fiend, balor, yugoloth, or night hag that is especially mighty. That patron’s aims are evil—the corruption or destruction of all things, ultimately including you—and your path is defined by the extent to which you strive against those aims.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nMake a Deal with the Lower Planes\nYour pact draws on the Lower Planes, the realms of perdition. You might forge a bargain with a demon lord such as Demogorgon or Orcus; an archdevil such as Asmodeus; or a pit fiend, balor, yugoloth, or night hag that is especially mighty. That patron’s aims are evil—the corruption or destruction of all things, ultimately including you—and your path is defined by the extent to which you strive against those aims.\nLevel 3: Dark One’s Blessing\nWhen you reduce an enemy to 0 Hit Points, you gain Temporary Hit Points equal to your Charisma modifier plus your Warlock level (minimum of 1 Temporary Hit Point). You also gain this benefit if someone else reduces an enemy within 10 feet of you to 0 Hit Points.\nLevel 3: Fiend Spells\nThe magic of your patron ensures you always have certain spells ready; when you reach a Warlock level specified in the Fiend Spells table, you thereafter always have the listed spells prepared.\nFiend Spells\n\n\nWarlock Level\nSpells\n\n\n3\nBurning Hands, Command, Scorching Ray, Suggestion\n\n\n5\nFireball, Stinking Cloud\n\n\n7\nFire Shield, Wall of Fire\n\n\n9\nGeas, Insect Plague\n\n\nLevel 6: Dark One’s Own Luck\nYou can call on your fiendish patron to alter fate in your favor. When you make an ability check or a saving throw, you can use this feature to add 1d10 to your roll. You can do so after seeing the roll but before any of the roll’s effects occur.\nYou can use this feature a number of times equal to your Charisma modifier (minimum of once), but you can use it no more than once per roll. You regain all expended uses when you finish a Long Rest.\nLevel 10: Fiendish Resilience\nChoose one damage type, other than Force, whenever you finish a Short or Long Rest. You have Resistance to that damage type until you choose a different one with this feature.\nLevel 14: Hurl Through Hell\nOnce per turn when you hit a creature with an attack roll, you can try to instantly transport the target through the Lower Planes. The target must succeed on a Charisma saving throw against your spell save DC, or the target disappears and hurtles through a nightmare landscape. The target takes 8d10 Psychic damage if it isn’t a Fiend, and it has the Incapacitated condition until the end of your next turn, when it returns to the space it previously occupied or the nearest unoccupied space.\nOnce you use this feature, you can’t use it again until you finish a Long Rest unless you expend a Pact Magic spell slot (no action required) to restore your use of it.\n"
  },
  {
    "Id": "8c233614-faf8-4eca-b995-94260118a890",
    "Name": "Great Old One Patron",
    "ParentClass": "Warlock",
    "Source": "Player\u0027s Handbook",
    "Description": "Unearth Forbidden Lore of Ineffable Beings\n\nWhen you choose this subclass, you might bind yourself to an unspeakable being from the Far Realm or an elder god—a being such as Tharizdun, the Chained God; Zargon, the Returner; Hadar, the Dark Hunger; or Great Cthulhu. Or you might invoke several entities without yoking yourself to one. The motives of these beings are incomprehensible, and the Great Old One might be indifferent to your existence. But the secrets you’ve learned nevertheless allow you to draw strange magic from it.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nUnearth Forbidden Lore of Ineffable Beings\nWhen you choose this subclass, you might bind yourself to an unspeakable being from the Far Realm or an elder god—a being such as Tharizdun, the Chained God; Zargon, the Returner; Hadar, the Dark Hunger; or Great Cthulhu. Or you might invoke several entities without yoking yourself to one. The motives of these beings are incomprehensible, and the Great Old One might be indifferent to your existence. But the secrets you’ve learned nevertheless allow you to draw strange magic from it.\nLevel 3: Awakened Mind\nYou can form a telepathic connection between your mind and the mind of another. As a Bonus Action, choose one creature you can see within 30 feet of yourself. You and the chosen creature can communicate telepathically with each other while the two of you are within a number of miles of each other equal to your Charisma modifier (minimum of 1 mile). To understand each other, you each must mentally use a language the other knows.\nThe telepathic connection lasts for a number of minutes equal to your Warlock level. It ends early if you use this feature to connect with a different creature.\nLevel 3: Great Old One Spells\nThe magic of your patron ensures you always have certain spells ready; when you reach a Warlock level specified in the Great Old One Spells table, you thereafter always have the listed spells prepared.\nGreat Old One Spells\n\n\nWarlock Level\nSpells\n\n\n3\nDetect Thoughts, Dissonant Whispers, Phantasmal Force, Tasha\u0027s Hideous Laughter\n\n\n5\nClairvoyance, Hunger of Hadar\n\n\n7\nConfusion, Summon Aberration\n\n\n9\nModify Memory, Telekinesis\n\n\nLevel 3: Psychic Spells\nWhen you cast a Warlock spell that deals damage, you can change its damage type to Psychic. In addition, when you cast a Warlock spell that is an Enchantment or Illusion, you can do so without Verbal or Somatic components.\nLevel 6: Clairvoyant Combatant\nWhen you form a telepathic bond with a creature using your Awakened Mind, you can force that creature to make a Wisdom saving throw against your spell save DC. On a failed save, the creature has Disadvantage on attack rolls against you, and you have Advantage on attack rolls against that creature for the duration of the bond.\nOnce you use this feature, you can’t use it again until you finish a Short or Long Rest unless you expend a Pact Magic spell slot (no action required) to restore your use of it.\nLevel 10: Eldritch Hex\nYour alien patron grants you a powerful curse. You always have the Hex spell prepared. When you cast Hex and choose an ability, the target also has Disadvantage on saving throws of the chosen ability for the duration of the spell.\nLevel 10: Thought Shield\nYour thoughts can’t be read by telepathy or other means unless you allow it. You also have Resistance to Psychic damage, and whenever a creature deals Psychic damage to you, that creature takes the same amount of damage that you take.\nLevel 14: Create Thrall\nWhen you cast Summon Aberration, you can modify it so that it doesn’t require Concentration. If you do so, the spell’s duration becomes 1 minute for that casting, and when summoned, the Aberration has a number of Temporary Hit Points equal to your Warlock level plus your Charisma modifier.\nIn addition, the first time each turn the Aberration hits a creature under the effect of your Hex, the Aberration deals extra Psychic damage to the target equal to the bonus damage of that spell.\n"
  },
  {
    "Id": "6d41a3a4-18de-4868-9885-8694e2d8b8ee",
    "Name": "Abjurer",
    "ParentClass": "Wizard",
    "Source": "Player\u0027s Handbook",
    "Description": "Shield Companions and Banish Foes\nYour study of magic is focused on spells that block, banish, or protect—ending harmful effects, banishing evil influences, and protecting the weak. Abjurers are sought when baleful spirits require exorcism, when locations must be guarded against magical spying, and when portals to other planes of existence must be closed. Adventuring parties value Abjurers for the protection they provide against a variety of hostile magic and other attacks.\n\nChoose two Wizard spells from the Abjuration school, each of which must be no higher than level 2, and add them to your spellbook for free.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nShield Companions and Banish Foes\nYour study of magic is focused on spells that block, banish, or protect—ending harmful effects, banishing evil influences, and protecting the weak. Abjurers are sought when baleful spirits require exorcism, when locations must be guarded against magical spying, and when portals to other planes of existence must be closed. Adventuring parties value Abjurers for the protection they provide against a variety of hostile magic and other attacks.\nLevel 3: Abjuration Savant\nChoose two Wizard spells from the Abjuration school, each of which must be no higher than level 2, and add them to your spellbook for free.\nIn addition, whenever you gain access to a new level of spell slots in this class, you can add one Wizard spell from the Abjuration school to your spellbook for free. The chosen spell must be of a level for which you have spell slots.\nLevel 3: Arcane ward\nYou can weave magic around yourself for protection. When you cast an Abjuration spell with a spell slot, you can simultaneously use a strand of the spell\u0027s magic to create a magical ward on yourself that lasts until you finish a Long Rest. The ward has a Hit Point maximum equal to twice your Wizard level plus your Intelligence modifier. Whenever you take damage, the ward takes the damage instead, and if you have any Resistances or Vulnerabilities, apply them before reducing the ward’s Hit Points. If the damage reduces the ward to 0 Hit Points, you take any remaining damage. While the ward has 0 Hit Points, it can’t absorb damage, but its magic remains.\nWhenever you cast an Abjuration spell with a spell slot, the ward regains a number of Hit Points equal to twice the level of the spell slot. Alternatively, as a Bonus Action, you can expend a spell slot, and the ward regains a number of Hit Points equal to twice the level of the spell slot expended.\nOnce you create the ward, you can\u0027t create it again until you finish a Long Rest.\nLevel 6: Projected Ward\nWhen a creature that you can see within 30 feet of yourself takes damage, you can take a Reaction to cause your Arcane Ward to absorb that damage. If this damage reduces the ward to 0 Hit Points, the warded creature takes any remaining damage. If that creature has any Resistances or Vulnerabilities, apply them before reducing the ward\u0027s Hit Points.\nLevel 10: Spell Breaker\nYou always have the Counterspell and Dispel Magic spells prepared. In addition, you can cast Dispel Magic as a Bonus Action, and you can add your Proficiency Bonus to its ability check.\nWhen you cast either spell with a spell slot, that slot isn\u0027t expended if the spell fails to stop a spell.\nLevel 14: Spell Resistance\nYou have Advantage on saving throws against spells, and you have Resistance to the damage of spells.\n"
  },
  {
    "Id": "3648f62a-de97-4c11-9344-706ae1b9135a",
    "Name": "Diviner",
    "ParentClass": "Wizard",
    "Source": "Player\u0027s Handbook",
    "Description": "Learn the Secrets of the Multiverse\nThe counsel of a Diviner is sought by those who want a clearer understanding of the past, present, and future. As a Diviner, you strive to part the veils of space, time, and consciousness. You work to master spells of discernment, remote viewing, supernatural knowledge, and foresight.\n\nChoose two Wizard spells from the Divination school, each of which must be no higher than level 2, and add them to your spellbook for free.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nLearn the Secrets of the Multiverse\nThe counsel of a Diviner is sought by those who want a clearer understanding of the past, present, and future. As a Diviner, you strive to part the veils of space, time, and consciousness. You work to master spells of discernment, remote viewing, supernatural knowledge, and foresight.\nLevel 3: Divination Savant\nChoose two Wizard spells from the Divination school, each of which must be no higher than level 2, and add them to your spellbook for free.\nIn addition, whenever you gain access to a new level of spell slots in this class, you can add one Wizard spell from the Divination school to your spellbook for free. The chosen spell must be of a level for which you have spell slots.\nLevel 3: Portent\nGlimpses of the future begin to press on your awareness. Whenever you finish a Long Rest, roll two d20s and record the numbers rolled. You can replace any D20 Test made by you or a creature that you can see with one of these foretelling rolls. You must choose to do so before the roll, and you can replace a roll in this way only once per turn.\nEach foretelling roll can be used only once. When you finish a Long Rest, you lose any unused foretelling rolls.\nLevel 6: Expert Divination\nCasting Divination spells comes so easily to you that it expends only a fraction of your spellcasting efforts. When you cast a Divination spell using a level 2\u002B spell slot, you regain one expended spell slot. The slot you regain must be of a level lower than the slot you expended and can\u0027t be higher than level 5.\nlevel 10: The Third Eye\nYou can increase your powers of perception. As a Bonus Action, choose one of the following benefits, which lasts until you start a Short or Long Rest. You can\u0027t use this feature again until you finish a Short or Long Rest.\nDarkvision. You gain Darkvision with a range of 120 feet.\nGreater Comprehension. You can read any language.\nSee Invisibility. You can cast See Invisibility without expending a spell slot.\nLevel 14: Greater Portent\nThe visions in your dreams intensify and paint a more accurate picture in your mind of what is to come. Roll three d20s for your Portent feature rather than two.\n"
  },
  {
    "Id": "685211fe-3984-4a28-aa98-f649876d45d9",
    "Name": "Evoker",
    "ParentClass": "Wizard",
    "Source": "Player\u0027s Handbook",
    "Description": "Create Explosive Elemental Effects\nYour studies focus on magic that creates powerful elemental effects such as bitter cold, searing flame, rolling thunder, crackling lightning, and burning acid. Some Evokers find employment in military forces, serving as artillery to blast armies from afar. Others use their power to protect others, while some seek their own gain.\n\nChoose two Wizard spells from the Evocation school, each of which must be no higher than level 2, and add them to your spellbook for free.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nCreate Explosive Elemental Effects\nYour studies focus on magic that creates powerful elemental effects such as bitter cold, searing flame, rolling thunder, crackling lightning, and burning acid. Some Evokers find employment in military forces, serving as artillery to blast armies from afar. Others use their power to protect others, while some seek their own gain.\nLevel 3: Evocation Savant\nChoose two Wizard spells from the Evocation school, each of which must be no higher than level 2, and add them to your spellbook for free.\nIn addition, whenever you gain access to a new level of spell slots in this class, you can add one Wizard spell from the Evocation school to your spellbook for free. The chosen spell must be of a level for which you have spell slots.\nLevel 3: Potent Cantrip\nYour damaging cantrips affect even creatures that avoid the brunt of the effect. When you cast a cantrip at a creature and you miss with the attack roll or the target succeeds on a saving throw against the cantrip, the target takes half the cantrip’s damage (if any) but suffers no additional effect from the cantrip.\nLevel 6: Sculpt Spells\nYou can create pockets of relative safety within the effects of your evocations. When you cast an Evocation spell that affects other creatures that you can see, you can choose a number of them equal to 1 plus the spell\u0027s level. The chosen creatures automatically succeed on their saving throws against the spell, and they take no damage if they would normally take half damage on a successful save.\nLevel 10: Empowered Evocation\nWhenever you cast a Wizard spell from the Evocation school, you can add your Intelligence modifier to one damage roll of that spell.\nLevel 14: Overchannel\nYou can increase the power of your spells. When you cast a Wizard spell with a spell slot of levels 1-5 that deals damage, you can deal maximum damage with that spell on the turn you cast it.\nThe first time you do so, you suffer no adverse effect. If you use this feature again before you finish a Long Rest, you take 2d12 Necrotic damage for each level of the spell slot immediately after you cast it. This damage ignores Resistance and Immunity.\nEach time you use this feature again before finishing a Long Rest, the Necrotic damage per spell level increases by 1d12.\n"
  },
  {
    "Id": "8b599e03-881f-4c4b-99a5-eac66393f864",
    "Name": "Illusionist",
    "ParentClass": "Wizard",
    "Source": "Player\u0027s Handbook",
    "Description": "Weave Subtle Spells of Deception\nYou specialize in magic that dazzles the senses and tricks the mind, and the illusions you craft make the impossible seem real.\n\nChoose two Wizard spells from the Illusion school, each of which must be no higher than level 2, and add them to your spellbook for free.",
    "FullContent": "\n\nSource: Player\u0027s Handbook\nWeave Subtle Spells of Deception\nYou specialize in magic that dazzles the senses and tricks the mind, and the illusions you craft make the impossible seem real.\nLevel 3: Illusion Savant\nChoose two Wizard spells from the Illusion school, each of which must be no higher than level 2, and add them to your spellbook for free.\nIn addition, whenever you gain access to a new level of spell slots in this class, you can add one Wizard spell from the Illusion school to your spellbook for free. The chosen spell must be of a level for which you have spell slots.\nLevel 3: Improved Illusions\nYou can cast Illusion spells without providing Verbal components, and if an Illusion spell you cast has a range of 10\u002B feet, the range increases by 60 feet.\nYou also know the Minor Illusion cantrip. If you already know it, you learn a different Wizard cantrip of your choice. The cantrip doesn’t count against your number of cantrips known. You can create both a sound and an image with a single casting of Minor Illusion, and you can cast it as a Bonus Action.\nLevel 6: Phantasmal Creatures\nYou always have the Summon Beast and Summon Fey spells prepared. Whenever you cast either spell, you can change its school to Illusion, which causes the summoned creature to appear spectral. You can cast the Illusion version of each spell without expending a spell slot, but casting it without a slot halves the creature’s Hit Points. Once you cast either spell without a spell slot, you must finish a Long Rest before you can cast the spell in that way again.\nLevel 10: Illusory Self\nWhen a creature hits you with an attack roll, you can take a Reaction to interpose an illusory duplicate of yourself between the attacker and yourself. The attack automatically misses you, then the illusion dissipates.\nOnce you use this feature, you can\u0027t use it again until you finish a Short or Long Rest. You can also restore your use of it by expending a level 2\u002B spell slot (no action required).\nLevel 14: Illusory Reality\nYou have learned to weave shadow magic into your illusions to give them a semi-reality. When you cast an Illusion spell with a spell slot, you can choose one inanimate, nonmagical object that is part of the illusion and make that object real. You can do this on your turn as a Bonus Action while the spell is ongoing. The object remains real for 1 minute, during which it can\u0027t deal damage or give any conditions. For example, you can create an illusion of a bridge over a chasm and then make it real and cross it.\n"
  }
]